[ 
  {
    "status": "AUTO",
    "work_start": "2022-05-10T08:00:00+02:00",
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2022-05-10T08:00:00+02:00",
    "title": {
      "EN": "Major outage in the storage backend: very limited or no access",
      "DK": "Stort udfald i backend-lageret: meget begrænset eller ingen adgang"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2022-05-11T08:00:00+02:00",
    "description": {
      "EN": "We experience serious problems with the backend storage infrastructure in the HPC Centre and it leads to massive outages on ERDA/IDMC and SIF. We are looking into the issue and will keep you updated here!", 
      "DK": "Vi er ramt af alvorlige problem med backend lagerets infrastruktur på HPC Centeret, og det fører til omfattende udfald på ERDA/IDMC og SIF. Vi arbejder på sagen og melder yderligere ud her!"
    },
    "announce_end": "2022-05-11T12:00:00+02:00"
  },
  {
    "status": "AUTO",
    "work_start": "2022-06-03T12:00:00+02:00",
    "systems": [
        "SIF"
    ],
    "announce_start": "2022-05-02T12:00:00+02:00",
    "title": {
      "EN": "SIF storage backend replacement", 
      "DK": "Udskiftning af SIF storage backend"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2022-06-10T12:00:00+02:00",
    "description": {
      "EN": "We are changing the SIF storage backend from Gluster to Lustre. During this task SIF will be either in read-only mode or offline. In effect no project administration can be done during this period and data upload is not possible. We will try to keep the downtime as short as possible. Addtional information will be posted on this page.",
      "DK": "Vi står for at skulle udskifte SIF storage backenden fra Gluster og til Lustre. I denne process vil SIF enten være offline eller i read-only mode, hvilket vi sige at der ikke kan udføres projektadministration eller uploades data. Vi vil prøve at holde nedetiden så kort som mulig og annoncere yderligere information via denne side. "
    },
    "announce_end": "2022-06-10T12:00:00+02:00"
  },
  {
    "status": "AUTO",
    "work_start": "2022-03-30T16:00:00+02:00",
    "systems": [
        "ERDA",
        "IDMC"
    ],
    "announce_start": "2022-03-30T16:00:00+02:00",
    "title": {
      "EN": "Broken brick fallout: recovering missing data",
      "DK": "Ødelagt brick og følger: genskabelse af manglende data"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2022-04-29T16:00:00+02:00",
    "description": {
      "EN": "We've restored most of the remaining recovered data from the lost brick in the backend storage to bring back the last approximate 20TB of data missing after we had to restore from the April 10th snapshot last Summer. Please refer to the older news from July and August for details. We do not want to cause further trouble by restoring into potential live data, so instead we've generally recovered with the original directory structure inside new 'storage-brick-recovery' folders in the root of the relevant user homes and workgroups shares. If you find such data in your home or Workgroup shares please copy or move data back into place if necessary. We apologize for the resulting inconvenience and don't hesitate to contact us on support@erda.dk if you have questions or need advice about how to copy/move any such data back into place e.g. with the Schedule Tasks functionality. We're following up about restoring a little additional recovered data mainly to locations without direct user access to modification, and we expect to finish that within the next few weeks.",
      "DK": "Vi har genskabt størstedelen af de udtrukne data fra den ødelagte brick i backendlageret, for igen at gøre de ca. 20TB data tilgængelige, som manglede efter vi sidste sommer var nødt til at genskabe fra et snapshot fra 10. april. Se venligst tidligere nyheder fra juli og august for nærmere detaljer. For ikke at skabe yderligere problemer ved at genskabe ind oveni potentielt aktive data, har vi valgt at genskabe samme struktur i nye 'storage-brick-recovery'-mapper i roden af de relevante brugermapper og workgroup shares. Hvis Du finder sådanne mapper i dit private lager eller Workgroup shares bedes Du selv flytte eller kopiere relevant data derfra og ind på plads. Vi beklager de gener det medfører og tøv ikke med at kontakte os på support@erda.dk ved spørgsmål eller om råd til at flytte evt store datasæt på plads, f.eks. ved hjælp af Schedule Tasks. Vi følger op på lidt tilbageværende data at genskabe hovedsageligt i placeringer hvor man som bruger ikke selv har adgang til at ændre, og det regner vi med at få overstået i løbet af de næste uger."
    },
    "announce_end": "2022-05-02T16:00:00+02:00"
    },
  {
    "status": "AUTO",
    "work_start": "2022-03-25T09:45:00+01:00", 
    "systems": [
        "ERDA", "IDMC", "SIF", "MiGrid"
    ], 
    "announce_start": "2022-03-25T09:30:00+01:00", 
    "title": {
      "EN": "Short notice ERDA/IDMC, SIF and MiGrid Maintenance and outages", 
      "DK": "Udfald på ERDA/IDMC, SIF og MiGrid med kort varsel"
    }, 
    "services": [
        "HTTPS",
        "DAG",
        "MODI",
        "HEL"
    ], 
    "work_end": "2022-03-25T10:15:00+01:00", 
    "description": {
      "EN": "We have to deploy a fix for a serious security issue in the Apache web server, which we rely on for a number of our services. This will result in a brief outage of the web server on all systems and may break active Jupyter sessions. Users with active sessions may need to logout of and stop their Jupyter servers then reload the main Jupyter page and Start DAG and so forth again. We are sorry for the inconvenience but security is first priority. The updates are applied and services are back in normal production.", 
      "DK": "Vi er nødt til at udrulle en vigtig sikkerhedsrettelse i den Apache web server vi benytter til en del af vores services. Det vil medføre et kort udfald på web-serveren på de nævnte systemer og muligvis afbryde igangværende Jupyter sessioner. Brugere med aktive Jupyter sessioner kan være nødt til at logge ud og stoppe deres Jupyter server for derefter at genindlæse Jupyter-forsiden og klikke Start DAG o.s.v. igen. Vi beklager de gener det måtte medføre, men sikkerhed har første prioritet. Opdateringerne er overstået og services tilbage i normal drift."
    }, 
    "announce_end": "2022-03-26T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2022-03-09T16:00:00+01:00", 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2022-03-02T09:00:00+01:00", 
    "title": {
      "EN": "Planned ERDA Seafile Maintenance", 
      "DK": "Planlagt vedligehold på ERDA Seafile"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2022-03-09T18:00:00+01:00", 
    "description": {
      "EN": "We have a number of pending system and minor bugfixes on ERDA Seafile. The work will require a full Seafile system restart after the system updates. ERDA Seafile will therefore be down for shorter or longer periods during the work, but all other ERDA services should remain fully available. We expect the work to last a couple of hours, but reserve until next morning in case of unforeseen problems. We did in fact complete the upgrades within a couple of hours so everything is back to normal with the updated Seafile version 9.0.4.", 
      "DK": "Vi har en række udestående system- og mindre funktionelle opdateringer på ERDAs Seafile. Arbejdet kræver genstart af hele Seafile systemet efter systemopdateringerne. ERDA Seafile vil derfor være utilgængelig i kortere eller længere perioder under opdateringen, men det skulle ikke berøre øvrige ERDA services. Arbejdet forventes at tage et par timer, men vi afsætter indtil næste morgen i tilfælde af uforudsete problemer. Vi klarede opgraderingen på et par timer så alt er tilbage i normal drift med den opdaterede Seafile version 9.0.4."
    }, 
    "announce_end": "2022-03-10T12:00:00+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2022-02-25T13:15:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF", "MiGrid"
    ], 
    "announce_start": "2022-02-25T13:15:00+01:00", 
    "title": {
      "EN": "UCPH Login and Access Issues", 
      "DK": "Problemer med KU-login og adgang"
    }, 
    "services": [
        "HTTP", "HTTPS", "DAG", "MODI"
    ], 
    "work_end": "2022-03-07T12:15:00+01:00", 
    "description": {
      "EN": "According to our logs and user reports the UCPH OpenID service, which is used for ERDA/IDMC, SIF and MiGrid web access, has been unstable since Friday afternoon. Every operation involving actual login or just login session checks may take a long time and some times so long that it results in a page load timeout and various other page navigation errors. We tracked it down to be a problem with the UCPH OpenID service response times and have reported it to University IT. They have restarted their OpenID service and it looks like it solved the problem. At least we observed no more errors at our end since they did about noon today, March 7th.", 
      "DK": "Ud fra vores logs og brugerhenvendelser at dømme har KUs OpenID service, som benyttes til ERDA/IDMC, SIF og MiGrid web-adgang, været ustabil siden fredag eftermiddag. Alle operationer som involverede enten login eller kontrol af aktiv login session kan tage lang tid, og fører nogle gange ligefrem til timeout og forskellige andre sideindlæsningsfejl. Vi har analyseret os frem til at det er et problem med svartiderne fra KUs OpenID service, og har kontaktet KU-IT om sagen. De har genstartet deres OpenID service og det ser ud til at det løste problemet. I hvert fald har vi ikke observeret fejl hos os siden de gjorde det omkring middag idag, den 7. marts."
    }, 
    "announce_end": "2022-03-09T12:00:00+01:00"
  }, 
 {
    "status": "AUTO", 
    "work_start": "2022-02-10T15:00:00+01:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2022-02-01T11:00:00+01:00",
    "title": {
      "EN": "Planned ERDA/IDMC and SIF Maintenance",
      "DK": "Planlagt ERDA/IDMC og SIF vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2022-02-10T17:00:00+01:00",
    "description": {
      "EN": "It's time for a thorough update of the ERDA/IDMC and SIF in order to apply new storage space. The work will involve both frontend and backend down-time for low-level system updates. Thus all services will be temporarily unavailable for shorter or longer periods during the maintenance window. We finished the ERDA/IDMC and SIF work in a couple of hours before 17:00 as expected. All systems should be back online. Please note that the MODI service specifically may still suffer downtime until tomorrow morning due to roll-out of some unrelated but urgent security updates.",
      "DK": "Det er tid til en gennemgribende opdatering af ERDA/IDMC og SIF systemerne mhp at tilføje nyt lagerplads. Arbejdet kræver nedetid på både frontend og backend til grundlæggende systemopdateringer og der vil derfor forekomme kortere eller længere nedetid på alle services undervejs. Vi blev som forventet færdige med arbejdet på et par timer inden kl 17:00. Alle systemer er tilbage i almindelig drift. Bemærk dog at MODI specifikt vil kunne opleve nedetid indtil i morgen tidlig grundet udrulning af ikke-relaterede men vigtige sikkerhedsopdateringer."
    },
    "announce_end": "2022-02-11T10:00:00+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2021-12-23T11:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2021-12-23T08:00:00+01:00", 
    "title": {
      "EN": "Severe Supply Chain Problems and Throttled Write Speed", 
      "DK": "Alvorlige leveringproblemer og begrænset skrivehastighed"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2022-02-10T18:00:00+01:00", 
    "description": {
      "EN": "As previously announced the current global computer chip shortage and reduced production capacities give us serious headaches regarding the continued gradual expansion of the ERDA/IDMC and SIF backend storage. We have recently added our last remaining spare storage brick and within a short time frame it already received 25TB data! So we are running out of space too fast and vendors report several months of delivery time even on already ordered hardware. We have therefore taken the drastic but required counter measure of introducing throttling on the write speed at IDMC since December 23rd and on ERDA since December 27th. This will remain in effect until we have enough free space again. That is, we still strongly urge You as users to clean up any big (~terabyte) data sets of little or no importance to help us all out of this bind. Otherwise it will last until we receive the ordered additional storage hardware. The data growth on SIF is much smaller so we are are still considering the situation there. The throttling only applies to the new brick with much space and it has the unpleasant side effect that reads from that same brick may be significantly slowed when writes are stalling. The good news is that we have actually started receiving the new storage hardware, and it looks like we will have it all at hand and installed within the next weeks. Update: We have phased out the write throttling completely and will add new storage very soon as announced separately.",
      "DK": "Som tidligere meldt ud giver de aktuelle globale problemer med mangel på computer-chips og begrænset produktionskapacitet os gevaldig hovedpine omkring den fortsatte løbende opskalering af ERDA/IDMC og SIF backend-lageret. Vi har for nyligt koblet den sidste ledige brick på backend-lageret og den havde allerede efter kort tid modtaget 25TB data! Så vi løber for hurtigt tør for ledig plads i lageret og leverandørerne melder om måneders leveringstid selv på allerede bestilt hardware. Derfor har vi i dag taget det drastiske men åbenbart nødvendige skridt at indføre begrænsning på skrivehastigheden på IDMC fra den 23. december og ligeledes på ERDA fra den 27. december. Det vil blive opretholdt indtil vi igen har nok ledig plads. D.v.s. vi opfordrer stadig kraftigt til at I som brugere rydder op i evt store (~terabyte) datasæt af begrænset eller ingen værdi for at hjælpe os alle ud af denne kattepine. Alternativt må vi afvente modtagelsen af det allerede bestilte yderligere lagringshardware. Datavæksten på SIF er markant mindre så der afventer vi situationen for nu. Skrivehastigheden er i praksis kun begrænset på den nyeste brick med meget plads, og den har desværre den ubehagelige sideeffekt at læsning derfra også til tider er hårdt ramt på hastigheden når mange skrivninger hænger i kø. Den gode nyhed er at vi nu rent faktisk er begyndt at modtage det bestilte nye hardware og regner med at have det hele modtaget og installeret i løbet af de næste uger. Opdatering: Vi har nu udfaset skrivebegrænsningerne helt og tilføjer nyt lagerplads meget snart som annonceret særskilt."
    }, 
    "announce_end": "2022-02-17T16:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-11-26T17:00:00+01:00", 
    "systems": [
        "SIF"
    ], 
    "announce_start": "2021-11-26T17:00:00+01:00", 
    "title": {
      "EN": "SIF Outage", 
      "DK": "SIF nede"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2021-11-29T10:15:00+01:00",
    "description": {
      "EN": "A central log partition ran full on SIF, and since we are not allowed to miss important log entries it automatically shut off the entire frontend system. After cleaning up space for logs the system is back online. Sorry for the inconvenience from the lack of access.", 
      "DK": "En central log-partition på SIF løb tør for plads, og eftersom vi skal logge vigtige beskeder, lukkede den automatisk hele frontend systemet ned. Efter en oprydning fandt vi plads til logs og systemet er atter tilbage online. Vi Beklager generne fra den manglende adgang."
    }, 
    "announce_end": "2021-11-29T10:15:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-11-19T18:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2021-11-19T10:00:00+01:00", 
    "title": {
      "EN": "Supply Chain Problems and Continued Storage Scaling", 
      "DK": "Leveringproblemer og fortsat lagerskalering"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2022-02-01T12:00:00+01:00", 
    "description": {
      "EN": "The current global computer chip shortage and reduced production capacities are beginning to cause serious headaches regarding the continued gradual expansion of the ERDA/IDMC and SIF backend storage. We still have additional storage bricks to add, but we are running low and vendors report several months of delivery time even on already ordered hardware. In effect this MIGHT lead to a situation where we will have to throttle data growth on ERDA/IDMC and SIF e.g. through upload rate limits or have You as users clean up any big (~terabyte) data sets of little or no importance. This is of course rather inconvenient and something we are trying our best to avoid, but we think it only fair to announce well ahead to let you plan and act in due time. Please refer to the newer announcement for details and updates.", 
      "DK": "De aktuelle globale problemer med mangel på computer-chips og begrænset produktionskapacitet begynder at føre til alvorlige bekymringer omkring den fortsatte løbende opskalering af ERDA/IDMC og SIF backend-lageret. Vi har stadig ekstra bricks at sætte på, men der er ved at være lavvande i lageret og leverandørerne melder om måneders leveringstid selv på allerede bestilt hardware. Resultatet KAN blive at vi ender i en situation hvor vi bliver nødt til at skrue ned for datavæksten på ERDA/IDMC og SIF f.eks. via begrænsning på uploadhastigheden eller at I som brugere rydder op i evt store (~terabyte) datasæt af begrænset eller ingen værdi. Det er selvfølgelig en ubehagelig situation og noget vi gør vores bedste for at undgå, men vi foretrækker at melde ud allerede nu mhp at give alle mulighed for at planlægge og agere rettidigt. Se venligst nyere punkt om samme for detaljer og opdatering."
    }, 
    "announce_end": "2022-02-01T16:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-11-16T10:00:00+01:00", 
    "systems": [
        "ERDA"
    ], 
    "announce_start": "2021-11-16T10:00:00+01:00", 
    "title": {
      "EN": "ERDA Unstable/Offline, Seafile Change", 
      "DK": "ERDA ustabil/nede, Seafile ændring"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2021-11-16T11:38:00+01:00", 
    "description": {
      "EN": "ERDA Web was severely overloaded resulting in connections getting dropped with timeout and general web instabilities. It looks like the legacy Seafile proxy access caused the troubles with thousands of stale connections hanging around and dragging the web server to a halt. We disabled it to see if it solves the problem. For long-time Seafile users still using the ancient setup with the legacy server address[0] this means that it is now strictly necessary to migrate to the new stand-alone Seafile server address[1]. We did a restart of the frontend to clean up hanging processes/connections and will keep an eye on the system to see if the problems return.", 
      "DK": "ERDAs webserver var ekstremt overbelastet, hvilket første til at nye forbindelser blev afvist med timeout og generel ustabilitet på web. Det ser ud til at den gamle Seafile proxy-adgang efterlod tusindvis af hængende forbindelser som til sidst tvang webserveren i knæ. Vi har slået proxy-adgangen fra for at se om det løser problemet. Det betyder at langvarige Seafile-brugere nu endegyldigt er tvunget til at opdatere deres klient fra at bruge den gamle server-adresse[0] til at bruge den aktuelle adresse[1] på den særskilte Seafile-server. Vi genstartede frontend for at få ryddet op i de hængende processer/forbindelser og holder fortsat øje med systemet mhp om problemerne skulle vende tilbage."
    }, 
    "references": {
      "EN": [
          "https://sid.erda.dk/seafile",
          "https://seafile.erda.dk/seafile"
      ], 
      "DK": [
          "https://sid.erda.dk/seafile",
          "https://seafile.erda.dk/seafile"
      ]
    },
    "announce_end": "2021-11-17T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-11-15T00:29:00+01:00", 
    "systems": [
        "ERDA", "SIF"
    ], 
    "announce_start": "2021-11-15T08:00:00+01:00", 
    "title": {
      "EN": "ERDA and SIF Outage", 
      "DK": "ERDA og SIF nede"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2021-11-15T09:10:00+01:00", 
    "description": {
      "EN": "Our backend storage acted up and took out both ERDA and SIF this morning. In addition the problems caused a central log partition to run full on ERDA, and since we are not allowed to miss important log entries it automatically shut off the entire frontend system. After getting the backend storage online and cleaning up space for logs both systems are back online. Sorry for the inconvenience from the lack of access.", 
      "DK": "Vores backendlager ville ikke makke ret til morgen og fik både ERDA og SIF offline. Oveni løb en central log-partition på ERDA tør for plads af samme grund, og eftersom vi skal logge vigtige beskeder, lukkede den automatisk hele frontend systemet ned. Efter vi fik backendlageret tilbage og fandt plads til logs er begge systemer tilbage online. Vi Beklager generne fra den manglende adgang."
    }, 
    "announce_end": "2021-11-16T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-11-10T17:00:00+01:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2021-11-02T13:00:00+01:00",
    "title": {
      "EN": "Planned ERDA/IDMC and SIF Maintenance",
      "DK": "Planlagt ERDA/IDMC og SIF vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-11-10T21:00:00+01:00",
    "description": {
      "EN": "It's time for a thorough update of the ERDA/IDMC and SIF systems to apply pending bug fixes and add a few new features. The work will involve frontend down-time for low-level system updates. Thus all services will be temporarily unavailable for shorter or longer periods during the maintenance window. We expect it to take a couple of hours, but keep the maintenance window open until next morning in case it drags out. The updates of ERDA/IDMC completed before 7pm and all their services are back online. SIF required more work and went back online towards 9pm. Please report any problems to our support as usual.",
      "DK": "Det er tid til en gennemgribende opdatering af ERDA/IDMC og SIF systemerne mhp at lægge udestående fejlrettelser ind og tilføje lidt nye funktionaliteter. Arbejdet kræver nedetid på frontend til grundlæggende systemopdateringer og der vil derfor forekomme kortere eller længere nedetid på alle services undervejs. Vi forventer at det kan klares på et par timer, men holder vedligeholdelsesvinduet åbent i tilfælde af at det trækker ud. Opdateringerne blev overstået på ERDA/IDMC inden kl. 19 og alle deres services er tilbage i almindelig drift. SIF krævede mere arbejde og kom tilbage i almindelig drift henved kl. 21. Kontakt os som altid gerne på vores support omkring evt problemer."
    },
    "announce_end": "2021-11-11T12:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-11-01T20:00:00+02:00",
    "systems": [
      "ERDA", "IDMC"
    ],
    "announce_start": "2021-10-26T12:00:00+02:00",
    "title": {
      "EN": "Monthly maintenance of DAG and MODI",
      "DK": "Månedlig vedligeholdelse af DAG og MODI"
    },
    "services": [
      "DAG", "MODI"
    ],
    "work_end": "2021-11-01T23:00:00+02:00",
    "description": {
      "EN": "We will apply general maintenance to the DAG and MODI services. Interruptions to these services will occur.", 
      "DK": "Vi udruller den månedelige opdatering og vedligeholdelse af DAG og MODI tjenesterne. Afbrydelser af disse tjenester vil forekomme."
    },
    "announce_end": "2021-11-03T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-10-15T14:24:00+02:00", 
    "systems": [
        "ERDA"
    ],
    "announce_start": "2021-10-15T14:24:00+02:00",
    "title": {
      "EN": "Unplanned downtime for ERDA web service",
      "DK": "Ikke planlagt nedetid for ERDA web servicen"
    },
    "services": [
      "Web"
    ],
    "work_end": "2021-10-15T16:52:00+02:00",
    "description": {
      "EN": "Unplanned downtime in the ERDA web service due to an internal database overloading. Apart from the landing page and certain static or simple user pages, all ERDA web pages would simply hang until timeout. The problem was identified and corrected, so that all services are now back online. Sorry for this inconvenience in relation to the missing web access.",
      "DK": "Ikke planlagt nedetid i ERDA web servicen pga. en overbelastet intern database. Bortset fra forsiden og enkelte statiske eller simple brugersider, hang alle ERDA websider bare indtil timeout. Det bagvedliggende problem er identificeret og rettet så alle services er tilbage i almindelig drift. Beklager generne fra den manglende webadgang."
  },
    "announce_end": "2021-10-16T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-10-06T16:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ],
    "announce_start": "2021-10-06T08:00:00+02:00",
    "title": {
      "EN": "Unplanned downtime for MODI service due to power outage",
      "DK": "Ikke planlagt nedetid for MODI servicen pga. strømudfald"
    },
    "services": [
      "MODI"
    ],
    "work_end": "2021-10-06T17:30:00+02:00",
    "description": {
      "EN": "Unplanned downtime in the MODI service due to power a outage. Sorry for the inconvenience from the lack of access. The failed storage volume has been corrected and the service is now back online. Sorry for this inconvenience.",
      "DK": "Ikke planlagt nedetid pga. en strømafbrydelse. Det fejlende datalager er nu blevet fixet og servicen er igen oppe. Beklager generne fra den manglende adgang."
  },
    "announce_end": "2021-10-07T08:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-10-06T08:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ],
    "announce_start": "2021-10-06T08:00:00+02:00",
    "title": {
      "EN": "Unplanned downtime due to hardware failure",
      "DK": "Ikke planlagt nedetid pga. hardware fejl"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-10-06T11:00:00+02:00",
    "description": {
      "EN": "Unplanned downtime due to PSU failures in two of our Gluster backend storage bricks. These PSU's have now been replaced. Sorry for the inconvenience from the lack of access.",
      "DK": "Ikke planlagt nedetid pga. fejl i PSU'erne på to af vores Gluster backend storage bricks. Disse PSU'er er nu skiftet. Beklager generne fra den manglende adgang."
  },
    "announce_end": "2021-10-06T11:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-10-04T21:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-09-28T09:00:00+02:00", 
    "title": {
      "EN": "Monthly maintenance of DAG and MODI",
      "DK": "Månedlig vedligeholdelse af DAG og MODI"
    }, 
    "services": [
      "DAG", "MODI"
    ], 
    "work_end": "2021-10-05T08:00:00+02:00", 
    "description": {
      "EN": "We will apply general maintenance to the DAG and MODI services. Interruptions to these services will occur. We completed the maintenance without issue and the services are running as expected.", 
      "DK": "Vi udruller den månedelige opdatering og vedligeholdelse af DAG og MODI tjenesterne. Afbrydelser af disse tjenester vil forekomme. Vi gennemførte denne vedligeholdelse uden problemmer og de nævnte services kører igen som forventet."
    }, 
    "announce_end": "2021-10-05T15:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-09-01T20:47:00+02:00", 
    "systems": [
        "SIF"
    ], 
    "announce_start": "2021-09-02T09:00:00+02:00", 
    "title": {
      "EN": "SIF Outage", 
      "DK": "SIF nede"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2021-09-02T10:50:00+02:00", 
    "description": {
      "EN": "We had a central log partition run full on SIF and since we are not allowed to miss any log entries it automatically shut off the entire system. After adding more disk space it is now back online. Sorry for the inconvenience from the lack of access.", 
      "DK": "En central log-partition på SIF løb tør for plads, og eftersom vi ikke må undlade at logge noget, lukkede den automatisk hele systemet ned. Vi har tilføjet mere diskplads og startet igen, så alt skulle være tilbage i normal drift. Beklager generne fra den manglende adgang."
    }, 
    "announce_end": "2021-09-03T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-09-10T19:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-09-07T09:00:00+02:00", 
    "title": {
      "EN": "MODI Compute nodes maintenance", 
      "DK": "MODI Compute node vedligeholdelse"
    }, 
    "services": [
      "MODI"
    ], 
    "work_end": "2021-09-10T21:00:00+02:00", 
    "description": {
      "EN": "We will apply general updates to the MODI compute nodes, interruption of compute jobs will happend.", 
      "DK": "Vi vil udrulle generelle opdateringer til MODI-beregningsknuderne, afbrydelse af beregningsjobs vil ske."
    }, 
    "announce_end": "2021-09-13T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-09-01T20:47:00+02:00", 
    "systems": [
        "SIF"
    ], 
    "announce_start": "2021-09-02T09:00:00+02:00", 
    "title": {
      "EN": "SIF Outage", 
      "DK": "SIF nede"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2021-09-02T10:50:00+02:00", 
    "description": {
      "EN": "We had a central log partition run full on SIF and since we are not allowed to miss any log entries it automatically shut off the entire system. After adding more disk space it is now back online. Sorry for the inconvenience from the lack of access.", 
      "DK": "En central log-partition på SIF løb tør for plads, og eftersom vi ikke må undlade at logge noget, lukkede den automatisk hele systemet ned. Vi har tilføjet mere diskplads og startet igen, så alt skulle være tilbage i normal drift. Beklager generne fra den manglende adgang."
    }, 
    "announce_end": "2021-09-03T10:00:00+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2021-08-24T11:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ],
    "announce_start": "2021-08-24T13:00:00+02:00",
    "title": {
      "EN": "Unplanned downtime due to Gluster storage brick failure",
      "DK": "Ikke planlagt nedetid pga. en disk fejlede i vores Gluster storage system"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-08-24T14:35:00+02:00",
    "description": {
      "EN": "Both ERDA and IDMC were down due to a failure in one of underlying disks in our Gluster storage system. This had the side effect of causing so much noise in the storage system that everything else got slowed down to a halt to avoid any damages. We corrected this issue by removing the disk from the system and restarted the service. Everything should now be back to normal",
      "DK": "Både ERDA og IDMC var nede på grund af en fejl i  af de underliggende diske i vores Gluster lagersystem. Dette havde den bivirkning, at det forårsagede så meget støj i lagersystemet, at alt andet endte med at stoppe for at undyderligere fejl. Vi rettede dette problem ved at fjerne disken fra systemet og genstarte tjenesten. Alt skulle nu være tilbage til normalen."  
  },
    "announce_end": "2021-08-25T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-08-18T11:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ],
    "announce_start": "2021-08-17T09:25:00+02:00",
    "title": {
      "EN": "Planned System and Backend Storage Maintenance",
      "DK": "Planlagt system- og backendlager-vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-08-18T16:50:00+02:00",
    "description": {
      "EN": "One of the storage blocks (JBOD) in the future backend storage needs to replaced by a vendor technician. The actual work should not take long but we only have the announced time frame as a guideline for when it will take place. This should only barely affect ERDA and IDMC and hopefully will not even be observed there as the block is not part of the general storage and is purely used for our own data. However, the MiGrid system will have to be taken offline during a significant part of the maintenance window and we will run pending system updates while at it. We started the migrid upgrade at 14 when the technician announced his arrival and finished the upgrades in order to be back in normal production before 17 when the storage maintenance was also finished. Everything should be back online.",
      "DK": "En af disksamlingerne (JBOD) i det fremtidige backendlager må udskiftes af leverandørens tekniker. Det burde ikke tage lang tid, men vi har kun den lidt løse udmeldte tidsramme fra leverandøren. Udskiftningen burde knap nok berøre ERDA og IDMC og bemærkes forhåbentlig slet ikke der, eftersom blokken ikke er den del af det almindelige lager og alene indeholder vores egne data. MiGrid er derimod nødt til at blive lukket ned under det meste af service-vinduet og vil i samme forbindelse køre udestående systemopdateringer. Vi gik igang med systemopdateringerne på migrid kl 14 da teknikeren meldte sin ankomst og blev færdige inden kl 17 hvor lagerarbejdet også var ovre. Alt skulle være tilbage i normal drift."
    },
    "announce_end": "2021-08-19T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-08-03T19:00:00+02:00", 
    "systems": [
        "ERDA",
        "IDMC"
    ], 
    "announce_start": "2021-08-03T09:00:00+02:00", 
    "title": {
      "EN": "Updating the MODI and DAG service to seperate the Proxy and the JupyterHub service", 
      "DK": "Opdatering af MODI og DAG for at seperere deres Proxy og JupyterHub service"
    }, 
    "services": [
        "DAG",
        "MODI"
    ], 
    "work_end": "2021-08-03T22:00:00+02:00", 
    "description": {
      "EN": "We will apply an update to the DAG and MODI services that split the underlying JupyterHub Proxy and the service itself. This will ensure that we can apply updates to both services going forward without the users experiencing any downtime. This update is now completed and the services are now back online.", 
      "DK": "Vi fortager en opdatering af DAG og MODI tjenesterne, denne opdatering vil dele den underliggende JupyterHub Proxyen og selve JupyterHub tjenesten. Dette vil sikre, at vi i fremtiden kan udrulle opdateringer til begge tjenester den at brugerne oplever nedetid. Denne opdatering er nu færdig, og de 2 services kører igen som forventet."
    }, 
    "announce_end": "2021-08-03T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-07-25T10:00:00+02:00", 
    "systems": [
        "ERDA",
        "IDMC"
    ], 
    "announce_start": "2021-07-24T12:00:00+02:00", 
    "title": {
      "EN": "General update maintenance of the DAG and MODI services", 
      "DK": "Generel opdatering og vedligeholdelse af DAG og MODI tjenesterne"
    }, 
    "services": [
        "DAG",
        "MODI"
    ], 
    "work_end": "2021-07-25T17:00:00+02:00", 
    "description": {
      "EN": "We will make a general update of the underlying DAG and MODI nodes, in addition to updating the JupyterHub service. This will cause periodic service interruptions thoughout the service windows. The maintenance is now complete and the services are running smoothly again", 
      "DK": "Vi foretager en generel opdatering og vedligeholdelse af de underliggende DAG og MODI noder ud over opdatering af JupyterHub tjenesten. Dette vil forårsage midlertidige service forstyrrelser i service vinduet. Opdatering og vedligeholdelse er nu overstået og de to services er nu tilbage i normal tilstand"
    }, 
    "announce_end": "2021-07-26T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-08-02T07:00:00+02:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "MiGrid"
    ], 
    "announce_start": "2021-07-08T12:30:00+02:00", 
    "title": {
      "EN": "Phasing out the legacy user interface - V3 as default", 
      "DK": "Udfasning af den gamle brugergrænseflade - V3 som standard"
    }, 
    "services": [
        "Web"
    ], 
    "work_end": "2021-08-02T12:00:00+02:00", 
    "description": {
      "EN": "We have offered the new modernized 'V3' user interface on ERDA, IDMC and MiGrid user web pages for almost a year now, and defaulted to it for all new users since the Autumn of 2020. Existing users by default remained on the legacy 'V2' interface, but had the opportunity to likewise manually switch to the modern V3 interface from their Settings page. After several months without any significant complaints about the new interface we have decided to gradually phase out the old one by switching to V3 for all users who did not activelly select V2. This consolidation is mainly done to avoid double maintainance and e.g. to get a single consistent way to warn and announce important information to all users. It will still be possible to revert to the V2 interface for a while until we retire it completely at the end of 2021. Please contact us on support about any issues you may discover due to the change in order for us to iron out any problems before the final phasing out.", 
      "DK": "Vi har i næsten et år tilbudt den moderniserede 'V3' brugergrænseflade på ERDA, IDMC og MiGrid brugersiderne og de har været standard for alle nye brugere siden efteråret 2020. Eksisterende brugere forblev som udgangspunkt på den ældre 'V2' brugergrænseflade, men kunne tilsvarende manuelt skifte over på V3 brugerfladen fra deres Settings side. Efter adskillige måneder uden væsentlige indvendinger omkring den nye brugerflade har vi besluttet langsomt at udfase den gamle ved i første omgang at skifte over til V3 for alle som ikke aktivt har valgt V2. Denne konsolidering er hovedsageligt for at undgå dobbeltarbejde med vedligehold og bl.a. at opnå en enkelt konsistent måde at varsle og annoncere vigtig information til alle brugere. Det vil i en overgangsperiode forblive muligt at skifte tilbage til V2 brugerfladen indtil vi udfaser den helt ved udgangen af 2021. Skriv gerne til os på support omkring eventuelle problemer ifm skiftet så vi kan nå at få dem løst inden den endelige udfasning."
    }, 
    "announce_end": "2021-08-16T23:59:59+01:00"
  }, 
  {
    "status": "AUTO",
    "work_start": "2021-07-12T08:00:00+02:00",
    "systems": [
        "ERDA",
        "IDMC"
    ],
    "announce_start": "2021-07-12T08:00:00+02:00",
    "title": {
      "EN": "Broken brick fallout: recovering missing data",
      "DK": "Ødelagt brick og følger: genskabelse af manglende data"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-08-23T16:00:00+02:00",
    "description": {
      "EN": "We're finally able to recover data from the lost brick in the backend storage to slowly bring back the approximate 20TB of data currently missing after we had to restore from the April 10th snapshot as mentioned in older news. We do not want to cause further trouble by restoring into potential live data, so instead we generally recover with the original directory structure inside newly created 'storage-brick-recovery' folders in the root of the relevant user homes and workgroups shares. We'll have to ask owners to please copy or move data found there into place themselves. We apologize for the resulting inconvenience and urge you to inform us on support@erda.dk with details if you notice any of your data urgently missing. Then we may be able to fast-track that particular data recovery. Similarly you are welcome to contact us for help regarding moving any huge data sets back into place.",
      "DK": "Vi er endelig nået til at kunne udlæse data fra den ødelagte brick i backendlageret, så vi nu langsomt genskaber de ca. 20TB data, som i øjeblikket mangler efter vi var nødt til at genskabe fra et snapshot fra 10. april jvf tidligere nyheder. For ikke at skabe yderligere problemer ved at genskabe ind oveni potentielt aktive data, har vi valgt at genskabe samme struktur i de nylavede 'storage-brick-recovery'-mapper i roden af de relevante brugermapper og workgroup shares. Ejerne bedes så venligst selv flytte eller kopiere data derfra og ind på plads. Vi beklager de gener det medfører og opfordrer jer til at give os besked på support@erda.dk med nærmere oplysninger såfremt særligt vigtige data savnes, da vi så kan forsøge at prioritere genskabelsen deraf. Kontakt os også gerne for hjælp til at flytte evt store datasæt på plads."
    },
    "announce_end": "2021-08-30T16:00:00+02:00"
    },
  {
    "status": "AUTO",
    "work_start": "2021-07-06T17:00:00+02:00",
    "systems": [
        "ERDA",
        "IDMC"
    ],
    "announce_start": "2021-07-05T11:00:00+02:00",
    "title": {
      "EN": "Updating DAG to introduce the AI Notebook",
      "DK": "Opdatering af DAG til at introducere AI Notebooken"
    },
    "services": [
      "DAG"
    ],
    "work_end": "2021-07-07T09:00:00+02:00",
    "description": {
      "EN": "The DAG service will temporarily experience interruptions to introduce the AI Notebook. This new Notebook provides most machine learning libraries that one would expect in a Python environment when using techniques such as Deep Learning.",
      "DK": "DAG-tjenesten vil midlertidigt opleve afbrydelser for at introducere AI Notebook. Denne nye Notebook tilbyder de fleste maskinlæringsbiblioteker, som man kunne forvente i et Python-miljø når man skal bruge teknikker såsom Deep Learning."
    },
    "announce_end": "2021-07-07T11:00:00+02:00"
    },
  {
    "status": "AUTO",
    "work_start": "2021-07-01T16:00:00+02:00",
    "systems": [
        "ERDA",
        "IDMC"
    ],
    "announce_start": "2021-07-01T16:00:00+02:00",
    "title": {
      "EN": "Updating MODI to support OpenMPI 4.x, will cause downtime for the service",
      "DK": "Opdatering af MODI til understøttelse af OpenMPI 4.x, vil medføre nedetid for tjenesten"
    },
    "services": [
      "MODI"
    ],
    "work_end": "2021-07-02T09:00:00+02:00",
    "description": {
      "EN": "There is a discrepancy between the OpenMPI version inside our Jupyter images (4.0.5) and the MODI Slurm nodes (2.1.1). The nodes and the MODI service will be updated to support version 4.x. This work was completed succesfully and the service is again back online.",
      "DK": "Der er en uoverensstemmelse mellem OpenMPI versionen inde i vores Jupyter-billeder (4.0.5) og MODI Slurm-knuder (2.1.1). Knuder og MODI-tjenesten opdateres til at understøtte version 4.x. Arbejdet er veloverstået, og MODI er igen oppe at køre."
    },
    "announce_end": "2021-07-02T09:00:00+02:00"
    },
  {
    "status": "AUTO",
    "work_start": "2021-06-18T10:00:00+02:00",
    "systems": [
        "ERDA",
        "IDMC"
    ],
    "announce_start": "2021-06-18T08:00:00+02:00",
    "title": {
      "EN": "Broken brick fallout: recovering missing data and exposing invisible data",
      "DK": "Ødelagt brick og følger: genskabelse af manglende data og eksponering af usynlige data"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-07-09T16:00:00+02:00",
    "description": {
      "EN": "After recently loosing a brick in the backend storage and restoring from the April 10th snapshot the backend storage file system has some metadata inconsistencies and a subset of the data added since April are missing. The former results in certain existing and unharmed files going invisible on the frontend. We're working on fixing the metadata to get those data visible again and are making good progress. Furthermore the broken brick held about 230TB when we lost it and the April 10th snapshot we restored from had about 210TB of them. So about 20TB of recent data is really missing now. We'll continue trying to recover as much of this recently added data as possible from the broken brick. We have copied it to another system for further investigation and analysis with various disk forensics tools. A couple of those tools which yielded promising results in small scale tests are scanning now. How long it takes to scan and hopefully restore is unknown, but the initial scans finished at the end of week 26. They appear to be useful for further recovery attemps, which commenced but also run slowly. We apologize for the resulting inconvenience and urge you to inform us on support@erda.dk with details if you notice any of your data missing.",
      "DK": "Efter vi for nyligt mistede en brick i backendlageret og vi var nødt til at genskabe data fra vores 10. april snapshot har backend storage filsystemet nogle inkonsistenser i sine metadata og et udsnit af de data som er lagt ind siden april mangler. Førstnævnte betyder at nogle eksisterende og uskadte filer er blevet usynlige på frontend. Vi arbejder på at reparere metadata for at de igen bliver synlige og har fået en del rettet. Yderligere havde den ødelagte brick omkring 230TB data og det april-snapshot vi genskabte fra havde kun 210TB. Så omkring 20TB nylige data mangler reelt nu. Vi vil fortsat arbejde på at redde mest muligt af disse nyligt tilføjede data fra den ødelagte brick. Vi har kopieret al data derfra til et andet system for yderligere undersøgelser og analyse med forskellige datarednings-værktøjer. Et par af disse værktøjer som viste gode resultater i små tests skanner i øjeblikket. Hvor længe det varer med skan og efterfølgende genskabelse er svært at sige, men de indledende skanninger blev færdige sidst i uge 26. De ser umiddelbart ud til at kunne benyttes til yderligere forsøg på at genskabe de tabte data, hvilket kører langsomt videre. Vi beklager de gener det medfører og opfordrer jer til at give os besked på support@erda.dk med nærmere oplysninger såfremt noget af jeres data er forsvundet."
    },
    "announce_end": "2021-07-11T12:00:00+02:00"
    },
  {
    "status": "AUTO",
    "work_start": "2021-06-11T08:10:00+02:00",
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2021-06-11T08:15:00+02:00",
    "title": {
      "EN": "Major outage in the storage backend: very limited or no access",
      "DK": "Stort udfald i backend-lageret: meget begrænset eller ingen adgang"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-06-16T21:00:00+02:00",
    "description": {
      "EN": "We experienced a serious problem with the backend storage infrastructure in the HPC Centre on June 11th leading to a major outage of ERDA/IDMC and SIF. Only ERDA Seafile was unaffected and we got SIF back in normal production a few hours later. However, we realized that ERDA/IDMC had lost a backend storage brick due to a human error. As we did not see any obvious solution we decided to put both systems back online in read-only mode without the lost brick. That way users are able to read most data while we work on resolving the problem. In effect ERDA/IDMC for the time being runs only with partial data visibility and without write access. For a number of users the partial data visibility results in login problems, and for the rest it typically means specific files or folders missing. Further analysis indicates that the storage brick in question is in a severely broken state and there's a risk that we may have effectively lost all data on it. As explained in our FAQ[0] we do NOT promise backup of ERDA/IDMC user data in general. Still, we do make regular local snapshots of the storage bricks and send a copy to a remote location on approximately a monthly basis, because that's how long it takes to transfer one. Thus, we have initiated a restore of the latest such full remote backup of the corrupted brick dating back to April 10th. This means that we can get ERDA/IDMC back to a fully working state, albeit with some of the more recent data missing. We completed the recovery process on Wednesday June 16th and got ERDA/IDMC back into normal production with full read+write access before 9 in the evening. We'll try hard to recover as much of the more recent data as possible from the broken brick, but it looks very challenging and time consuming, without any guarantee of success. First task is attempting to deduct missing folders after the restore, based on the brick snapshot metadata. Thanks for your patience and we are sorry for the inconvenience.", 
      "DK": "Den 11. juni oplevede vi et alvorligt problem med backend lagerets infrastruktur på HPC Centeret, og det førte til omfattende udfald på ERDA/IDMC og SIF. Kun ERDA Seafile var ikke berørt og vi fik SIF tilbage i almindelig drift efter nogle få timer. Vi kunne dog konstatere at ERDA/IDMC havde mistet en brick i backend lageret pga en menneskelig fejl, og i og med vi ikke kunne se nogen umiddelbar løsning, besluttede vi at starte begge systemer kun med læse-adgang og uden den tabte brick. På den måde leverer de i det mindste brugeradgang til at læse hovedparten af data, mens vi arbejder videre på at løse problemet. I praksis kører ERDA/IDMC således i øjeblikket kun med delvis datasynlighed og uden skriveadgang. For et antal brugere fører det til grundlæggende loginproblemer, og for de resterende betyder det typisk at nogle filer eller mapper mangler. Yderligere analyse har vist at den pågældende storage brick er alvorligt medtaget, og der er en risiko for at vi reelt har tabt al data derpå. Som forklaret i vores OSS[0] garanterer vi IKKE generel backup af ERDA/IDMC brugerdata. Vi foretager dog jævnlige lokale snapshots af storage bricks og sender kopi til fjernlagring omtrent på månedlig basis, da det er så lang tid det tager at overføre. Vi har således sat en genetablering af seneste sådanne fjernkopi af den tabte brick fra den 10. april igang. Det betyder at vi kan få ERDA/IDMC tilbage i en fuldt funktionel tilstand, omend med mangler i de nyere data. Genetableringen blev færdig onsdag den 16. juni og vi fik ERDA/IDMC tilbage i normal drift med fuld læse- og skrive-adgang inden kl 21. Vi vil naturligvis gøre vi vores bedste for at redde mest muligt af det nyere data fra den ødelagte brick, men det ser yderst udfordrende og tidskrævende ud, uden garanti for at det lykkes. I første omgang vil vi forsøge at finde frem til hvilke mapper der mangler efter genetableringen vha brick snapshot metadata. Tak for jeres tålmodighed og vi beklager de gener det medfører."
    },
    "announce_end": "2021-06-20T12:00:00+02:00",
    "references": {
      "EN": [
          "https://erda.ku.dk"
      ], 
      "DK": [
          "https://erda.ku.dk"
      ]
    }
  },
  {
    "status": "AUTO", 
    "work_start": "2021-06-01T07:30:00+02:00", 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ],
    "announce_start": "2021-05-18T15:15:00+02:00",
    "title": {
      "EN": "Planned Network and Backend Storage Maintenance",
      "DK": "Planlagt netværks- og backendlager-vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-06-01T12:00:00+02:00",
    "description": {
      "EN": "We will make a few internal network changes and restructure parts of the backend storage layout. This should only barely affect ERDA and IDMC and hopefully will not even be observed there. However, the MiGrid system will have to be taken offline during most of the maintenance window. ERDA is back in normal production after slightly longer downtime than expected due to some pending low level system updates. IDMC is back as well after some network issues after the updates. MiGrid returned as well after the remaining network changes.",
      "DK": "Vi foretager et par interne netværksjusteringer og omstrukturerer dele af backend-lageret. Det skulle gerne kun marginalt berøre ERDA og IDMC, og forhåbentlig slet ikke bemærkes der. MiGrid er derimod nødt til at blive lukket ned under det meste af service-vinduet. ERDA er tilbage i almindelig drift efter en lidt forlænget nedetid pga nogle udestående basale systemopdateringer. IDMC er også tilbage i drift nu hvor lidt yderligere netværksproblemer efter opdateringerne er løst. MiGrid er ligeledes tilbage eftre yderligere netarbejde."
    },
    "announce_end": "2021-06-02T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-05-26T10:30:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-05-26T10:20:00+02:00", 
    "title": {
      "EN": "Power Outage - DAG/MODI/HEL Unstable", 
      "DK": "Strømudfald - DAG/MODI/HEL ustabile"
    }, 
    "services": [
        "DAG", "MODI", "HEL"
    ], 
    "work_end": "2021-05-27T10:00:00+02:00", 
    "description": {
      "EN": "There was a big power glitch in Copenhagen a bit past 10 today which also hit the HPC Center. Hosts not on emergency power went down and DAG/MODI/HEL Jupyter sessions are still to some extent affected. We're working on it and more info will follow.",
      "DK": "Der var et større udfald i strømmen i København lidt over 10 til formiddag som også ramte HPC Centeret. Maskiner som ikke er nødstrøm gik ned og DAG/MODI/HEL Jupyter-sessioner er til dels stadig berørt. Vi arbejder på sagen og mere info følger."
    }, 
    "announce_end": "2021-05-27T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-05-10T17:00:00+02:00", 
    "systems": [
        "IDMC"
    ],
    "announce_start": "2021-05-04T09:30:00+02:00",
    "title": {
      "EN": "Planned IDMC Migration and Maintenance",
      "DK": "Planlagt migrering og vedligehold af IDMC"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-05-10T19:15:00+02:00",
    "description": {
      "EN": "We will migrate the IDMC frontend to a new and fundamentally upgraded host and plan to apply other pending updates in the process. The work will require some downtime during the migration. Thus, all services will be unavailable for a while. We completed the migration at 19:15 and all services should be back online.",
      "DK": "Vi migrerer IDMCs frontend til en ny og grundlæggende opdateret maskine og lægger udestående opdateringer på ved samme lejlighed. Arbejdet vil kræve noget nedetid i forbindelse med migreringen. Alle services vil derfor være utilgængelige i et stykke tid. Vi blev færdige med migreringen 19:15 og alle services er tilbage i almindelig drift."
    },
    "announce_end": "2021-05-11T10:00:00+02:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-05-02T09:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-27-04T14:00:00+01:00", 
    "title": {
      "EN": "Planned DAG and HEL Maintenance", 
      "DK": "Planlagt vedligehold på DAG og HEL"
    }, 
    "services": [
        "DAG", "HEL"
    ], 
    "work_end": "2021-05-02T16:00:00+02:00",
    "description": {
      "EN": "Update and general maintenance of DAG and HEL to apply pending host system updates and roll out significantly updated Jupyter notebook images. The work will involve down-time for low-level updates to complete. Thus all DAG and HEL Jupyter services will be temporarily unavailable one or more times during the maintenance window. The notebook updates include removal of Python 2, which reached official End-of-Life January 1st 2020, as well as several general package updates. Please report any issues you may encounter after the update.", 
      "DK": "Opdatering og generelt vedligehold af DAG og HEL inklusive udestående grundlæggende systemopdateringer samt udrulning af markant opdaterede Jupyter notebooks. Arbejdet vil medføre perioder med nedetid ved aktivering af dybereliggende opdateringer. Således vil alle DAG og HEL Jupyter-services midlertidigt være utilgængelige i løbet af vedligeholdelsesvinduet. Notebook-opdateringerne inkluderer fjernelse af Python 2, som officielt løb ud af support 1. januar 2020. såvel som adskillige generelle pakkeopdateringer. Meld gerne tilbage om eventuelle problemer opstået efterfølgende."
    }, 
    "announce_end": "2021-05-03T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-04-13T07:30:00+02:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2021-03-23T12:00:00+02:00",
    "title": {
      "EN": "Planned ERDA/IDMC and SIF Maintenance",
      "DK": "Planlagt ERDA/IDMC og SIF vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-04-13T08:55:00+02:00",
    "description": {
      "EN": "We need to move around some more backend storage hosts to keep scaling the available storage, and avoid running out of disk space on ERDA/IDMC and SIF. This is mainly the SIF tasks postponed from March 22nd. The work will involve backend storage down-time for the shuffling. Thus all services will be temporarily unavailable for shorter or longer periods during the maintenance window. We completed the work and all systems are back online.",
      "DK": "Vi er nødt til at rokere rundt på nogle maskiner i backend-lageret for at skalere den tilgængelige lagerplads og undgå at løbe tør for diskplads på ERDA/IDMC og SIF. Det er hovedsageligt de udsatte SIF-opgaver fra den 22. marts. Arbejdet kræver nedetid på backend-lageret under flytningen, og der vil derfor forekomme kortere eller længere nedetid på alle services undervejs. Arbejdet er overstået og alle systemer er tilbage i almindelig drift."
    },
    "announce_end": "2021-04-14T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-03-29T13:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-03-29T13:00:00+02:00", 
    "title": {
      "EN": "Power Drop - MODI Offline", 
      "DK": "Strømudfald - MODI nede"
    }, 
    "services": [
      "MODI"
    ], 
    "work_end": "2021-03-30T08:00:00+02:00", 
    "description": {
      "EN": "There was a power drop in Copenhagen including at HCØ, affecting the SCIENCE HPC Center and in particular the physical hosts not on emergency power. Most prominently MODI was hit with the front end and compute nodes going down. We had to do quite a bit of low-level work to get the network file system back in shape, but we finished just in time for Tuesday standard working hours. Still, let it be a reminder to all users that the storage on MODI is considered volatile and ALL important data must explicitly be transferred to permanent UCPH storage. You can use e.g. the ERDA mount to send it there conveniently.",
      "DK": "Der var et udfald i strømmen i København inklusiv på HCØ, hvilket berørte SCIENCE HPC Centeret og specielt maskiner uden nødstrøm. Det gik især ud over MODI hvor front end og regneknuder gik ned. Vi måtte igennem en del arbejde med at få netværksfilsystemet vakt til live, men det lykkedes lige til standard arbejdstid tirsdag morgen. Lad det samtidig være en påmindelse til alle brugere om at lageret på MODI er at betragte som flygtigt og at ALLE væsentlige data skal overføres til en permanent KU-placering. Man kan f.eks. benytte ERDA mount til nemt at sende det dertil."
    }, 
    "announce_end": "2021-03-30T12:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-03-22T07:30:00+01:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2021-03-16T16:00:00+01:00",
    "title": {
      "EN": "Planned ERDA/IDMC and SIF Maintenance",
      "DK": "Planlagt ERDA/IDMC og SIF vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-03-22T08:40:00+01:00",
    "description": {
      "EN": "We need to move around some backend storage hosts to keep scaling the available storage, and avoid running out of disk space on ERDA/IDMC and SIF. The work will involve backend storage down-time for the shuffling. Thus all services will be temporarily unavailable for shorter or longer periods during the maintenance window. We had to postpone the SIF tasks but the remaining work completed in about an hour and ERDA/IDMC are back online.",
      "DK": "Vi er nødt til at rokere rundt på nogle maskiner i backend-lageret for at skalere den tilgængelige lagerplads og undgå at løbe tør for diskplads på ERDA/IDMC og SIF. Arbejdet kræver nedetid på backend-lageret under flytningen, og der vil derfor forekomme kortere eller længere nedetid på alle services undervejs. Vi blev nødt til at udsætte SIF-opgaverne men arbejdet ift ERDA/IDMC fik vi overstået på en times tid og de er tilbage i almindelig drift."
    },
    "announce_end": "2021-03-23T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-03-21T09:33:00+01:00",
    "systems": [
      "ERDA",
      "IDMC"
    ],
    "announce_start": "2021-03-20T20:13:00+01:00",
    "title": {
      "EN": "Another outage in the storage backend: partial data visibility",
      "DK": "Endnu et udfald i backend-lageret: begrænset dataadgang"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-03-21T10:28:00+01:00",
    "description": {
      "EN": "We had another drop out of the backend storage brick, which acted up last month. Some files stored there therefore again turned invisible/inaccessible on ERDA/IDMC. Again there was disk partitions running full on that brick. After freeing up some more space there everything should be back online. However, with one partition still pretty full it may happen again. We'll monitor and work on a long-term solution as soon as backend storage experts check in. Please report any further issues on support as usual.", 
      "DK": "Vi havde endnu et udfald på samme maskine i backend-lageret, som der var bøvl med i sidste måned. Nogle filer lagret derpå blev derfor igen usynlige/utilgængelige på ERDA/IDMC. Vi fandt igen at diskpartitioner var løbet fuld på maskinen. Efter oprydning for at finde fri plads derpå skulle alt gerne være tilbage i normal drift. En enkelt partition er dog stadig ganske fyldt så vi holder øje og arbejder videre med en langsigtet løsning så snart vores lagereksperter møder ind. Yderligere fejl bedes som altid meldt til support."
    },
    "announce_end": "2021-03-22T12:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-03-19T17:00:00+01:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "SIF",
        "MiGrid"
    ],
    "announce_start": "2021-03-18T09:40:00+01:00",
    "title": {
      "EN": "Access Issues this Weekend - UCPH Firewall Upgrades",
      "DK": "Adgangsudfald denne weekend - KU firewallopgraderinger"
    },
    "services": [
        "Web",
        "DAG",
        "MODI",
        "HEL",
        "DOI"
    ],
    "work_end": "2021-03-21T18:00:00+01:00",
    "description": {
      "EN": "UCPH IT have announced major firewall upgrades the entire weekend. The SCIENCE HPC Center is NOT behind the general UCPH firewalls but site web login, Jupyter access and UCPH DOI minting on Archives rely on central UCPH services and therefore will likely be affected to some extent. Thus all mentioned services may be temporarily unavailable for shorter or longer periods during the announced maintenance window. Please note that OpenID login sessions have a default lifetime of 24 hours so active login sessions should remain usable despite OpenID service outages until session expiry and renewal. You might want to re-login Friday afternoon if your plan to use our systems on Friday evening or Saturday. Sharelinks, Seafile and access on WebDAVS, SFTP/SSHFS and FTPS should remain unaffected. We have contacted UCPH IT about prioritizing especially the OpenID service needed for log in and Jupyter. We noticed a 15 minute access outage to the main ERDA entry page[0] on Friday evening but access is back. In case it disappears again you can still use the alternative entry page URL[1] or the direct ERDA UCPH user login URL[2]. UCPH-IT haven't responded to our inquiry about prioritizing OpenID and their general service information[3] is pretty sparse but apparently it's completed now.",
      "DK": "KU-IT har varslet større firewallopgraderinger hele weekenden. SCIENCE HPC Centeret er IKKE bag KUs generelle firewall, men site web login, Jupyter-adgang og DOI-tildeling på Archives er bundet op på centrale KU-services og vil derfor sandsynligvis være berørt i noget omfang. Således må der forventes kortere eller længere udfald i adgangen til de nævnte services under det udmeldte service vindue. Bemærk venligst at OpenID login-sessioner som standard gælder i 24 timer så aktive login-sessioner skulle forblive brugbare til trods for udfald i OpenID servicen indtil sessionen udløb og fornyelse. Du kan evt lave re-login fredag eftermiddag hvis du planlægger at bruge vores systemer fredag aften og lørdag. Sharelinks, Seafile og adgang via WebDAVS, SFTP/SSHFS og FTPS skulle forblive fuldt tilgængelige. Vi har kontaktet KU-IT omkring at prioritere adgangen til især OpenID-servicen til log ind og Jupyter. Vi bemærkede et 15 minutters udfald på adgangen til den normale ERDA forside[0] fredag aften, men adgangen er tilbage. I tilfælde af at den forsvinder igen kan man altid benytte den alternative forsideadresse[1] eller direkte ERDA KU-bruger login på [2]. KU-IT har ikke svaret på vores henvendelse om prioritering af OpenID og deres driftsinfo[3] er meget kortfattet om detaljer, men den er tilsyneladende overstået nu."
    },
    "announce_end": "2021-03-22T10:00:00+01:00",
    "references": {
      "EN": [
          "https://erda.ku.dk",
          "https://www.erda.dk",
          "https://erda.dk",
          "https://it.ku.dk/driftinfo/"
      ], 
      "DK": [
          "https://erda.ku.dk",
          "https://www.erda.dk",
          "https://erda.dk",
          "https://it.ku.dk/driftinfo/"
      ]
      }
  },
  {
    "status": "AUTO",
    "work_start": "2021-03-03T20:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-26-02T09:00:00+01:00", 
    "title": {
      "EN": "Planned DAG and HEL Maintenance", 
      "DK": "Planlagt vedligehold på DAG og HEL"
    }, 
    "services": [
        "DAG", "HEL"
    ], 
    "work_end": "2021-03-03T20:50:00+01:00",
    "description": {
      "EN": "Update and general maintenance of DAG to apply pending host system updates. The work will involve down-time for low-level updates to complete. Thus all DAG and HEL Jupyter services will be temporarily unavailable one or more times during the maintenance window. The upgrade is completed and affected systems are back online.", 
      "DK": "Opdatering og generelt vedligehold af DAG inklusive udestående grundlæggende systemopdateringer. Arbejdet vil medføre perioder med nedetid ved aktivering af dybereliggende opdateringer. Således vil alle DAG og HEL Jupyter-services midlertidigt være utilgængelige i løbet af vedligeholdelsesvinduet. Opgraderingen er vel overstået og de berørte systemer er tilbage i normal drift."
    }, 
    "announce_end": "2021-03-04T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-02-25T15:30:00+01:00",
    "systems": [
      "ERDA",
      "IDMC"
    ],
    "announce_start": "2021-02-25T15:30:00+01:00",
    "title": {
      "EN": "Another outage in the storage backend: partial data visibility",
      "DK": "Endnu et udfald i backend-lageret: begrænset dataadgang"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-02-25T16:52:00+01:00",
    "description": {
      "EN": "We had another drop out of the same backend storage brick, which acted up earlier today. All files stored there therefore again turned invisible/inaccessible on ERDA/IDMC. We have investigated some more and figured there was a disk partition running full on that brick. After freeing up some more space there everything should be back online - and hopefully then with no more outages. Please report any further issues on support as usual.", 
      "DK": "Vi havde endnu et udfald på samme maskine i backend-lageret, som der var bøvl med i morges. Alle filer lagret derpå blev derfor igen usynlige/utilgængelige på ERDA/IDMC. Vi har undersøgt yderligere og fundet frem til at en diskpartition var løbet fuld på maskinen. Efter oprydning for at finde fri plads derpå skulle alt gerne være tilbage i normal drift - og forhåbentlig så uden flere udfald. Yderligere fejl bedes som altid meldt til support."
    },
    "announce_end": "2021-02-26T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-02-25T06:13:00+01:00",
    "systems": [
      "ERDA",
      "IDMC"
    ],
    "announce_start": "2021-02-25T06:13:00+01:00",
    "title": {
      "EN": "Outage in the storage backend: partial data visibility",
      "DK": "Udfald i backend-lageret: begrænset dataadgang"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-02-25T10:15:00+01:00",
    "description": {
      "EN": "One of the backend storage bricks dropped out of the backend storage cluster this morning. All files stored there therefore turned invisible on ERDA/IDMC and resulted in partial data visibility and even login problems for people unlucky enough to have central user login data there. We have investigated and recovered the connection, so that everything should be back to normal again. Please report any further issues on support as usual.", 
      "DK": "En af maskinerne i backend-lageret hoppede ud af lagerklyngen til morgen. Alle filer lagret derpå blev derfor usynlige på ERDA/IDMC, og det førte til loginproblemer for enkelte brugere med centrale logindata lagret netop der. Vi undersøgte sagen og fik genskabt forbindelsen, så alt skulle være tilbage i normal drift. Yderligere fejl bedes som altid meldt til support."
    },
    "announce_end": "2021-02-25T16:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-02-17T16:30:00+01:00",
    "systems": [
      "ERDA",
      "IDMC"
    ],
    "announce_start": "2021-02-17T15:15:00+01:00",
    "title": {
      "EN": "MODI Memory Upgrade",
      "DK": "MODI hukommelsesopgradering"
    },
    "services": [
      "MODI"
    ],
    "work_end": "2021-02-17T17:00:00+01:00",
    "description": {
      "EN": "We'll increase the available memory on the MODI login node for better concurrent use scalability. The upgrade is virtual and should only take a few minutes for a restart, but it will break active Jupyter sessions.",
      "DK": "Vi skruer op for den tilgængelige hukommelse på MODI login-knuden for bedre at skalere til mange samtidige brugere. Opgraderingen er virtuel og skulle kun tage nogle få minutter til en genstart, men den vil afbryde igangværende Jupyter-sessioner."
    },
    "announce_end": "2021-02-18T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-02-09T20:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-02-09T13:25:00+01:00", 
    "title": {
      "EN": "Short notice DAG & HEL Maintenance and outages", 
      "DK": "Udfald på DAG & HEL med kort varsel"
    }, 
    "services": [
        "DAG",
        "HEL"
    ], 
    "work_end": "2021-02-09T23:20:00+01:00", 
    "description": {
      "EN": "Our recent emergency security updates introduced problems with e.g. the HPC Notebook and we urgently need to redeploy the DAG and HEL Jupyter stack to address that for the current HPPC course. This will result in a brief outage and may break active sessions. Users with active sessions may need to logout of and stop their Jupyter servers then reload the main Jupyter page and Start DAG and so forth again. We finished the redeployment and the Jupyter services are back online - now including the HPC notebook.", 
      "DK": "Vores seneste sikkerhedsopdatering har ført til problemer med bl.a. HPC Notebook, og vi bliver nødt til med kort varsel at genudrulle DAG og HEL Jupypter-stakken til det igangværende HPPC-kursus. Det vil medføre udfald på igangværende sessioner. Brugere med aktive Jupyter sessioner kan være nødt til at logge ud og stoppe deres Jupyter server for derefter at genindlæse Jupyter-forsiden og klikke Start DAG o.s.v. igen. Vi blev færdige med at genudrulle Jupyter og de berørte services er tilbage i drift - nu også med HPC notebook."
    }, 
    "announce_end": "2021-02-10T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-02-04T22:03:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-02-05T08:00:00+01:00", 
    "title": {
      "EN": "Power Outage - MODI Offline", 
      "DK": "Strømudfald - MODI nede"
    }, 
    "services": [
      "MODI"
    ], 
    "work_end": "2021-02-15T17:00:00+01:00", 
    "description": {
      "EN": "There was a power glitch in the greater Copenhagen area also affecting the HPC Center and in particular the physical hosts not on UPS (emergency power). We experienced MODI front end and compute nodes failing. The hosts are back online and in normal production after some maintenance and consolidation.",
      "DK": "Der var et udfald i strømmen i Storkøbenhavn, som også berørte HPC Centeret og specielt maskiner uden UPS (nødstrøm). Vi oplevede at MODI front end og regneknuder gik ned. Maskinerne er startet igen og sat tilbage i almindelig drift efter vedligehold og konsolidering."
    }, 
    "announce_end": "2021-02-17T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2021-02-03T16:00:00+01:00", 
    "systems": [
        "SIF"
    ],
    "announce_start": "2021-01-29T10:00:00+01:00",
    "title": {
      "EN": "Planned SIF Maintenance",
      "DK": "Planlagt SIF vedligehold"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2021-02-03T20:00:00+01:00",
    "description": {
      "EN": "Update and general maintenance of SIF to apply pending system errata and introduce a new feature to allow reassigning project ownership to another employee. The work will involve down-time for low-level updates to complete. Thus all services will be temporarily unavailable one or more times during the maintenance window. The upgrade commenced according to plan and all services are back online.",
      "DK": "Opdatering og generel vedligeholdelse af SIF for at lægge systemrettelser ind og introducere en ny funktion til at overdrage projektejerskab til en anden ansat. Arbejdet kræver nedetid til grundlæggende systemopdateringer, og der vil derfor forekomme udfald i alle services undervejs. Opdateringen forløb planmæssigt og alle services er tilbage i almindelig drift."
    },
    "announce_end": "2021-02-05T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-01-27T20:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-01-27T20:00:00+01:00", 
    "title": {
      "EN": "Emergency MODI Maintenance and outages", 
      "DK": "Nødvedligehold og udfald på MODI"
    }, 
    "services": [
        "MODI"
    ], 
    "work_end": "2021-01-30T10:00:00+01:00", 
    "description": {
      "EN": "Due to a critical security issue in one of the operating system packages MODI with all nodes needs to be updated and redeployed. This will result in outages and may break active sessions. We are sorry for the inconvenience, but security comes first. The update itself was rather quick but caused some fallout so the work stretched over multiple days with partial outages along the way. It was completed on Saturday morning and the service is back online. Users with active sessions may need to logout of and stop their Jupyter servers then reload the main Jupyter page and Start MODI and so forth again.", 
      "DK": "P.g.a. et kritisk sikkerhedsproblem i en operativsystem-komponent er det nødvendigt at opdatere og genstarte MODI og dens regneknuder. Det vil medføre udfald og forstyrre igangværende sessioner. Vi beklager generne men sikkerhed kommer altid først. Opdateringen tog i første omgang kun kort men medførte andre komplikationer. Så det endte med at trække ud i flere dage med delvise udfald inden vi blev færdige lørdag morgen, og servicen er nu tilbage i drift. Brugere med aktive Jupyter sessioner kan være nødt til at logge ud og stoppe deres Jupyter server for derefter at genindlæse Jupyter-forsiden og klikke Start MODI o.s.v. igen."
    }, 
    "announce_end": "2021-02-02T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2021-01-27T20:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2021-01-27T20:00:00+01:00", 
    "title": {
      "EN": "Emergency DAG & HEL Maintenance and outages", 
      "DK": "Nødvedligehold og udfald på DAG & HEL"
    }, 
    "services": [
        "DAG",
        "HEL"
    ], 
    "work_end": "2021-01-27T20:20:00+01:00", 
    "description": {
      "EN": "Due to a critical security issue in one of the operating system packages DAG and HEL need to be updated and redeployed. This will result in a brief outage and may break active sessions. We are sorry for the inconvenience, but security comes first. The update was quickly completed and the services are back online. Users with active sessions may need to logout of and stop their Jupyter servers then reload the main Jupyter page and Start DAG and so forth again.", 
      "DK": "P.g.a. et kritisk sikkerhedsproblem i en operativsystem-komponent er det nødvendigt at opdatere og genstarte DAG og HEL. Det vil medføre udfald på igangværende sessioner. Vi beklager generne men sikkerhed kommer altid først. Opdateringen er gennemført og services er tilbage i drift. Brugere med aktive Jupyter sessioner kan være nødt til at logge ud og stoppe deres Jupyter server for derefter at genindlæse Jupyter-forsiden og klikke Start DAG o.s.v. igen."
    }, 
    "announce_end": "2021-01-30T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-12-29T10:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-12-28T12:00:00+01:00", 
    "title": {
      "EN": "Power Outage - DAG/MODI/HEL Unstable", 
      "DK": "Strømudfald - DAG/MODI/HEL ustabile"
    }, 
    "services": [
        "DAG", "MODI", "HEL"
    ], 
    "work_end": "2021-01-08T16:00:00+01:00", 
    "description": {
      "EN": "We are experiencing serious power instabilities since the recent power outage in the HPC Center. Compute nodes are coming and going and causing instability to DAG/MODI/HEL Jupyter sessions. We probably need electrician staff to investigate and we have no clear schedule yet. More info to follow.",
      "DK": "Vi oplever kraftige udsving på strømforsyningen siden strømudfaldet forleden. Jupyter beregningsknuderne kommer og går temmelig tilfældigt og det fører til ustabile DAG/MODI/HEL-sessioner. Vi må have nok have en elektriker til at se på det og har endnu ingen tidsramme. Mere info følger."
    }, 
    "announce_end": "2021-01-08T16:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "outage_start": "2020-12-23T18:10:00+01:00", 
    "work_start": "2020-12-23T20:40:00+01:00", 
    "systems": [
        "ALL"
    ], 
    "announce_start": "2020-12-23T20:48:00+01:00", 
    "title": {
      "EN": "Massive Power Outage at the HPC Center, storage backend access unstable", 
      "DK": "Massivt strømudfald i HPC Centeret, adgang til backendlageret ustabilt"
    }, 
    "services": [
      "ALL"
    ], 
    "outage_end": "2020-12-23T23:33:00+01:00", 
    "work_end": "2020-12-23T23:40:00+01:00", 
    "description": {
      "EN": "There was a big power outage in the HPC Center and in particular it affected all equipment not on UPS (emergency power). The backend storage lost connection to a couple of storage bricks and was only partially accessible resulting in partial file visibility and login problems for some users. Especially ERDA and MiGrid were affected while SIF and IDMC looked better. We've had technicians and system admins working late to get everything back online now.",
      "DK": "Vi oplevede et større strømudfald på HPC Centeret og det gik naturligvis specielt ud over udstyr uden UPS (nødstrøm). Backendlageret mistede forbindelsen til et par bricks og var kun delvist tilgængeligt med partiel filadgang og loginproblemer for nogen til følge. Især ERDA og MiGrid var hårdt ramt, mens SIF og IDMC så bedre ud. Vi har haft teknikere og systemadministratorer på overarbejde for at få alting tilbage i drift nu."
    }, 
    "announce_end": "2020-12-25T10:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2020-12-01T16:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-11-12T13:00:00+01:00", 
    "title": {
      "EN": "Automatic Account Expiry, including for I/O services", 
      "DK": "Automatisk kontoudløb, inklusive for I/O services"
    }, 
    "services": [
        "SFTP", "WebDAVS", "FTPS"
    ], 
    "work_end": "2020-12-01T17:00:00+01:00", 
    "description": {
      "EN": "We have already enforced automatic ERDA/IDMC account expiry for a while on web access. UCPH users automatically get their ERDA/IDMC account renewed when successfully logging into the web pages through the UCPH OpenID service, while external users must explicitly renew their account access annually using the sign up form from the front page[0][1]. Starting December 1st we will extend the account expiry to cover the efficient I/O services as well. In effect that means that any configured ERDA/IDMC access to WebDAVS, SFTP or FTPS will also automatically expire when accounts do. We mainly do so to significantly reduce the risk of cracking and abuse of old unused accounts. Attempts to log in on the I/O services after general account expiry will trigger an email warning that the account is expired. In practice it has limited consequences for external users, who already go through the annual renewal process. For UCPH users, however, it means that it will be necessary to regularly renew account access to use our I/O services. This can either be done for a whole year at a time by repeating 'sign up' from the front page[0][1] or for 30 days simply by log in to ERDA/IDMC web. Thus, users solely using the web access don't need to worry or do anything new. Those who enabled 2-Factor authentication for all ERDA/IDMC account access can also just continue with their usual web login before their I/O service logins.", 
      "DK": "Vi har allerede i længere tid håndhævet automatisk kontoudløb på ERDA/IDMC web. KU-brugere får automatisk deres ERDA/IDMC-konto forlænget ved vellykket web-login gennem KUs OpenID service, mens eksterne brugere eksplicit skal igennem årlig fornyelse af deres kontoadgang vha tilmeldingsformularen fra forsiden[0][1]. Begyndende den 1. december udvider vi kontoudløb til også at dække de effektive I/O-services. I praksis betyder det at al adgang til WebDAVS, SFTP og FTPS også automatisk udløber sammen med kontoen. Det har vi valgt at indføre for kraftigt at reducere risikoen for indbrud og misbrug på gamle ubrugte konti. Forsøg på at logge ind via I/O-services efter kontoudløb vil medføre en advarsel på email om at kontoen er udløbet. Konsekvenserne er små for eksterne brugere, som allerede skal igennem den årlige fornyelse. KU-brugere skal derimod vænne sig til engang imellem at skulle forny adgang for at bevare fuld adgang til vores I/O services. Det kan enten ske for et helt år af gangen ved at gentage 'tilmelding' på forsiden[0][1] eller for 30 dage af gangen blot ved log ind på ERDA/IDMC web. Brugere som udelukkende benytter sig af web-adgang behøver altså ikke bekymre sig eller gøre noget nyt. Dem der har tilvalgt 2-faktor godkendelse for al ERDA/IDMC konto-adgang, kan ligeledes blot ufortrødent fortsætte med at logge ind på web inden deres I/O-service logins."
    }, 
    "references": {
      "EN": [
          "https://erda.ku.dk",
          "https://www.idmc.dk"
      ], 
      "DK": [
          "https://erda.ku.dk",
          "https://www.idmc.dk"
      ]
    }, 
    "announce_end": "2020-12-08T17:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2020-11-26T20:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-11-26T16:00:00+01:00", 
    "title": {
      "EN": "Brief DAG Maintenance", 
      "DK": "Kortvarigt vedligehold på DAG"
    }, 
    "services": [
      "DAG"
    ], 
    "work_end": "2020-11-26T22:00:00+01:00", 
    "description": {
      "EN": "DAG orchestration needs to be quickly restarted to address an issue with too frequent docker image updates. We will restart the JupyterHub which may result in lost connections. We apologize for the possible inconveniences and try to minimize the outage.", 
      "DK": "DAG orkestreringen er nødt til at genstartes for at løse et problem med for hyppige docker image opdateringer. Vi genstarter JupyterHub, hvilket kan give udfald på igangværende sessioner. Vi beklager de gener arbejdet måtte medføre og forsøger at minimere nedetiden."
    }, 
    "announce_end": "2020-11-27T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-11-25T16:15:00+01:00", 
    "systems": [
        "ERDA",
        "IDMC",
        "SIF"
    ],
    "announce_start": "2020-11-17T11:00:00+01:00",
    "title": {
      "EN": "Planned ERDA, IDMC and SIF Maintenance",
      "DK": "Planlagt vedligehold af ERDA, IDMC og SIF"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2020-11-25T21:50:00+01:00",
    "description": {
      "EN": "Update and general maintenance of ERDA, IDMC and SIF to apply pending system errata and replace a failing memory module in a backend storage host. We will use the opportunity to apply pending updates on the Jupyter DAG machines, except the specialized GPU ones. The work will involve down-time for hardware replacement and low-level updates to complete. Thus all services will be temporarily unavailable one or more times during the maintenance window. We ran into some boot issues with the backend storagehardware to delay the return but ERDA Seafile returned before 18 and everything else was back online a bit before 22 o'clock.",
      "DK": "Opdatering og generel vedligeholdelse af ERDA, IDMC og SIF for at lægge systemrettelser ind og skifte et ustabilt hukommelsesmodul i en af datalagermaskinerne. Ved samme lejlighed vil vi opgradere Jupyter DAG maskinerne, bortset fra de specialiserede med GPU. Arbejdet kræver nedetid til hardwareskift og grundlæggende systemopdateringer, og der vil derfor forekomme udfald i alle services undervejs. Vi rendte ind i opstartsproblemer på backend-lageret men ERDA Seafile var opppe igen inden 18 og alt inden kort inden kl 22."
    },
    "announce_end": "2020-11-26T12:00:00+01:00"
  },
  {
    "status": "AUTO",
    "work_start": "2020-10-26T22:00:00+01:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-10-22T15:00:00+01:00", 
    "title": {
      "EN": "Short-notice DAG Maintenance and outages", 
      "DK": "Kortfristet vedligehold og udfald på DAG"
    }, 
    "services": [
      "DAG"
    ], 
    "work_end": "2020-10-27T12:30:00+01:00", 
    "description": {
      "EN": "DAG has some continuing access issues for a few specific users, which we need to address and it will likely require one or more DAG service restarts. This will most likely interrupt all running sessions. We did a major clean up late last night and saw some fallout today with home dirs not being mounted in some of the Jupyter sessions. We continued the investigation and solved the remaining issues reported a bit past noon. Thus, DAG should be back online and we apologize for the inconvenience.", 
      "DK": "DAG udviser stadig problemer med adgang for enkelte brugere og vi er sandsynligvis nødt til at genstarte servicen for at adressere det. Vi forventer at det vil føre til et eller flere udfald på igangværende sessioner. Vi lavede en omfattende oprydning sent i aftes og undersøgte problemer med manglende adgang til data fra hjemmemappen i enkelte Jupyter sessions. Vi fik løst de sidste rapporterede problemer lidt over middag. DAG er således tilbage i normal drift, og vi beklager de gener arbejdet medførte."
    }, 
    "announce_end": "2020-10-28T10:00:00+01:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-10-17T10:00:00+02:00", 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2020-10-14T10:00:00+02:00", 
    "title": {
      "EN": "Planned ERDA Seafile Maintenance", 
      "DK": "Planlagt vedligehold på ERDA Seafile"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2020-10-17T12:55:00+02:00", 
    "description": {
      "EN": "We have a number of pending system and minor bugfixes on ERDA Seafile. The work will require a full Seafile system restart after the system updates. ERDA Seafile will therefore be down for shorter or longer periods during the work, but all other ERDA services should remain fully available. The upgrades are complete and the Seafile service is back online.", 
      "DK": "Vi har en række udestående system- og mindre funktionelle opdateringer på ERDAs Seafile. Arbejdet kræver genstart af hele Seafile systemet efter systemopdateringerne. ERDA Seafile vil derfor være utilgængelig i kortere eller længere perioder under opdateringen, men det skulle ikke berøre øvrige ERDA services. Opgraderingerne er gennemført og Seafile er tilbage i almindelig drift."
    }, 
    "announce_end": "2020-10-19T10:00:00+02:00"
  }, 
  {
    "status": "AUTO",
    "work_start": "2020-10-13T07:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-10-13T07:00:00+02:00", 
    "title": {
      "EN": "Short-notice DAG Maintenance", 
      "DK": "Kortfristet vedligehold på DAG"
    }, 
    "services": [
      "DAG"
    ], 
    "work_end": "2020-10-13T22:00:00+02:00", 
    "description": {
      "EN": "DAG has some access issues for a few specific users we need to address and it will likely require one or more DAG service restarts. This will most likely interrupt all running sessions. We did a bit of work before 8 this morning and will continue after standard office hours (17ish).", 
      "DK": "DAG udviser problemer med adgang for enkelte brugere og vi er sandsynligvis nødt til at genstarte servicen for at adressere det. Vi forventer at det vil føre til et eller flere udfald på igangværende sessioner. Vi lavede lidt arbejde på det i morges inden kl 8 og fortsætter med de potentielt forstyrrende handlinger efter almindelig arbejdstid (kl 17+)."
    }, 
    "announce_end": "2020-10-14T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-10-04T10:00:00+02:00", 
    "systems": [
        "ERDA"
    ],
    "announce_start": "2020-09-29T10:00:00+02:00",
    "title": {
      "EN": "Planned ERDA Maintenance",
      "DK": "Planlagt vedligehold af ERDA"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2020-10-04T12:00:00+02:00",
    "description": {
      "EN": "Update and general maintenance of ERDA to roll out the latest software versions. The update will likely require a reboot for low-level updates to complete. Thus all services will briefly be unavailable. The upgrade is complete after a reboot and some minutes of downtime. All services should be back online.",
      "DK": "Opdatering og generel vedligeholdelse af ERDA for at opdatere til nyeste software. Opdateringen kræver sandsynligvis en systemgenstart og vil derfor give et kort udfald i alle services. Arbejdet er overstået med nogle få minutters nedetid ifm genstarten. Alle services skulle være tilbage i almindelig drift."
    },
    "announce_end": "2020-10-05T10:00:00+02:00"
  },
  {
    "status": "AUTO",
    "work_start": "2020-09-27T10:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-09-23T09:00:00+02:00", 
    "title": {
      "EN": "Planned DAG and MODI Maintenance", 
      "DK": "Planlagt vedligehold på DAG og MODI"
    }, 
    "services": [
      "DAG", "MODI"
    ], 
    "work_end": "2020-09-27T18:00:00+02:00", 
    "description": {
      "EN": "DAG needs to be updated with a new configuration to distribute Notebook images to hosts in accordance with where they are used. Also a bug was discovered in the software we use to mount ERDA/IDMC that caused stale mounts to not be cleared out properly in certain circumstances. This work was completed as expected and both DAG/MODI should be back online.", 
      "DK": "DAG skal opdateres med en ny konfiguration for at distribuere Notebook images til hosts i overensstemmelse med, hvor de bruges. Der blev også opdaget en fejl i den software, vi bruger til at montere ERDA / IDMC, der forårsagede, at forældede mounts ikke blev ryddet korrekt under visse omstændigheder. Dette arbejde blev afsluttet som forventet, og både DAG/MODI skulle være tilbage online."
    }, 
    "announce_end": "2020-09-28T09:00:00+02:00"
  },
  {
    "status": "AUTO",
    "work_start": "2020-09-23T10:00:00+02:00", 
    "systems": [
        "MiGrid"
    ], 
    "announce_start": "2020-09-23T08:00:00+02:00", 
    "title": {
      "EN": "MiGrid Maintenance", 
      "DK": "Vedligehold på MiGrid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-09-23T12:00:00+02:00", 
    "description": {
      "EN": "The old MiGrid server is long overdue for retirement and we're finally migrating the migrid.org site to run on a new virtualized environment at the SCIENCE HPC Center. All services were briefly offline during the move. Everything should be back to normal now running from the new location, but please report any issues.", 
      "DK": "Den gamle MiGrid server trænger alvorligt til at blive pensioneret og vi migrerer lang om længe sitet til i stedet at køre i et virtualiseret miljø på SCIENCE HPC Centeret. Alle services var kortvarigt nede i forbindelse med selve skiftet. De skulle være tilbage i normal drift nu på den nye placering, men meld gerne evt fejl."
    }, 
    "announce_end": "2020-09-25T09:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-09-03T13:29:00+02:00", 
    "systems": [
      "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2020-09-03T16:35:00:00+02:00", 
    "title": {
      "EN": "Partial Data Access and Login Problems", 
      "DK": "Delvis dataadgang og loginproblemer"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-09-03T16:40:00+02:00", 
    "description": {
      "EN": "One of the backend storage bricks started misbehaving and as a result yielded partial data visibility, meaning that some files would appear missing even though they are actually intact. For some users this might include important login files, in effect preventing log in. We have investigated and found the direct cause and gotten it back online, but there might be underlying issues still lurking. We keep monitoring the situation for now.", 
      "DK": "En af maskinerne i backend-lageret opførte sig sygt hvilket resulterede i delvis datasynlighed, så en stribe filer kunne se ud til at mangle selv om de faktisk er intakte. For enkelte brugere kunne det involvere centrale loginfiler, og derved i praksis betyde afvist login. Vi har undersøgt sagen og håndteret det direkte problem så alt er online igen. Der kan dog være underliggende skjulte årsager vi endnu ikke har opdaget, så vi holder fortsat øje med situationen."
    }, 
    "announce_end": "2020-09-04T10:00:00+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-09-02T09:20:00+02:00", 
    "systems": [
        "ERDA"
    ],
    "announce_start": "2020-09-02T09:00:00+02:00", 
    "title": {
      "EN": "ERDA Down",
      "DK": "ERDA nede"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2020-09-02T11:08:00+02:00",
    "description": {
      "EN": "The ERDA frontend crashed because it ran out of space on a central log disk. We had to investigate and prepare additional disk space to get it back online. This unfortunately took a couple of hours, but things should be back to normal now.",
      "DK": "ERDAs frontend gik ned fordi den løb tør for plads på en central log-disk. Det tog desværre et par timer at fejlfinde og skaffe mere diskplads derpå, men alting skulle være tilbage i almindelig drift nu."
    },
    "announce_end": "2020-09-03T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-08-30T10:00:00+02:00", 
    "systems": [
        "ERDA"
    ],
    "announce_start": "2020-08-27T10:00:00+02:00",
    "title": {
      "EN": "Planned ERDA Maintenance",
      "DK": "Planlagt vedligehold af ERDA"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2020-08-30T18:05:00+02:00",
    "description": {
      "EN": "Update and general maintenance of ERDA to roll out the latest software versions. The actual update was kept limited and resulted in less than 10 minutes of downtime. Everything should be back online.",
      "DK": "Opdatering og generel vedligeholdelse af ERDA for at opdatere til nyeste software. Selve opdateringen blev holdt begrænset og resulterede i under 10 minutters nedetid. Alt er tilbage i normal drift."
    },
    "announce_end": "2020-08-31T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-08-23T10:00:00+02:00", 
    "systems": [
        "IDMC"
    ],
    "announce_start": "2020-08-20T08:00:00+02:00",
    "title": {
      "EN": "Planned IDMC Maintenance",
      "DK": "Planlagt vedligehold af IDMC"
    },
    "services": [
      "ALL"
    ],
    "work_end": "2020-08-23T12:00:00+02:00",
    "description": {
      "EN": "Update and general maintenance of IDMC to roll out the latest software versions. The actual update took about an hour with some down time for rebooting. The upgrade is complete and all services are back online.",
      "DK": "Opdatering og generel vedligeholdelse af IDMC for at opdatere til nyeste software. Selve opdateringen tog omkring en time med noget nedetid i forbindelse med systemgenstart. Opdateringen er overstået og alle services tilbage i drift."
    },
    "announce_end": "2020-08-24T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-08-16T09:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ],
    "announce_start": "2020-08-07T08:00:00+02:00",
    "title": {
      "EN": "Planned DAG Maintenance",
      "DK": "Planlagt vedligehold af DAG"
    },
    "services": [
      "DAG"
    ],
    "work_end": "2020-08-16T15:00:00+02:00",
    "description": {
      "EN": "Update and general maintenance of the DAG service. This work was completed successfully and DAG is back online as scheduled",
      "DK": "Opdatering og generel vedligeholdelse af DAG-tjenesten. Dette arbejde blev afsluttet med succes, og DAG er online igen som planlagt"
    },
    "announce_end": "2020-08-17T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-08-14T10:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-08-14T10:00:00+02:00", 
    "title": {
      "EN": "Power Outage - DAG Unstable", 
      "DK": "Strømudfald - DAG ustabil"
    }, 
    "services": [
      "DAG"
    ], 
    "work_end": "2020-08-14T12:00:00+02:00", 
    "description": {
      "EN": "There was a big power outage at HCØ also affecting the HPC Center and in particular the physical hosts not on UPS (emergency power). We experienced a few DAG compute nodes failing and causing instability to DAG sessions. The hosts are back online and things should be fully functional again. You may have to restart any active sessions to recover from the outages.",
      "DK": "Vi oplevede et større strømudfald på HCØ idag og det berørte også HPC Centeret og specielt maskiner uden UPS (nødstrøm). Vi oplevede at flere DAG beregningsknuder fejlede og førte til ustabile DAG-sessioner. Maskinerne er tilbage og alting skulle fungere igen. Det kan dog være nødvendigt at genstarte igangværende DAG-sessioner for at adressere udfaldet."
    }, 
    "announce_end": "2020-08-14T16:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-07-01T16:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2020-06-16T08:00:00+02:00", 
    "title": {
      "EN": "Planned ERDA, IDMC and SIF Maintenance", 
      "DK": "Planlagt vedligehold på ERDA, IDMC og SIF"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-07-01T20:00:00+02:00", 
    "description": {
      "EN": "We need to expand the underlying storage system and will use the opportunity to apply pending system and minor feature updates on the ERDA, IDMC and SIF frontends. The work will require downtime in relation to the storage and system updates. Thus all ERDA, IDMC and SIF services except ERDA Seafile will be down for shorter or longer periods during the maintenance window. We completed the work before 20:00 and everything should be back to normal.", 
      "DK": "Vi er nødt til at udbygge det underliggende lagersystem og benytter lejligheden til at køre et antal udestående system- og nogle mindre funktionelle opdateringer på ERDA, IDMC og SIF frontends. Arbejdet kræver nedetid ifm lager- og systemopdateringerne. Alle ERDA, IDMC og SIF services bortset fra ERDA Seafile vil være nede i kortere eller længere perioder under arbejdet. Vi blev færdige med arbejdet inden 20:00 og alt skulle køre som normalt."
    }, 
    "announce_end": "2020-07-02T12:00:00+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-06-28T12:00:00+02:00", 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2020-06-26T12:00:00+02:00", 
    "title": {
      "EN": "Planned DAG and MODI Update and Maintenance", 
      "DK": "Planlagt vedligehold og update på DAG og MODI"
    }, 
    "services": [
      "DAG", "MODI"
    ], 
    "work_end": "2020-06-28T23:00:00+02:00", 
    "description": {
      "EN": "Both DAG and MODI JupyterHub services needs to be upgraded so that they support the new JupyterLab edition, which includes several UI upgrades and fixes. This work was completed successfully and both DAG and MODI are back online as scheduled", 
      "DK": "Både DAG og MODI JupyterHub-tjenester skal opgraderes, så de understøtter den nye JupyterLab-udgave, der inkluderer flere UI-opgraderinger og rettelser. Dette arbejde blev afsluttet med succes, og både DAG og MODI er tilbage online som planlagt"
    }, 
    "announce_end": "2020-06-29T12:00:00+02:00"
  },
  {
    "status": "AUTO",
    "work_start": "2020-06-02T17:00:00+02:00",
    "systems": [
      "ERDA",
      "IDMC"
    ],
    "announce_start": "2020-06-02T14:30:00+02:00",
    "title": {
      "EN": "MODI Scratch Space Upgrade",
      "DK": "MODI Scratch Plads Opgradering"
    },
    "services": [
      "MODI"
    ],
    "work_end": "2020-06-02T19:30:00+02:00",
    "description": {
      "EN": "We are upgrading the shared scratch space for the MODI service, so that each user will now have 50 GB instead of 200 MB of available storage to both stage jobs and save results. This work was completed successfully and the MODI service is now back online",
      "DK": "Vi opgraderer det delte scratch space til MODI-tjenesten, så hver bruger nu har 50 GB i stedet for 200 MB ledig lagerplads til både staging af jobs og til at gemme resultater på. Dette arbejde blev afsluttet med succes, og MODI-tjenesten er nu tilbage online"
    },
    "announce_end": "2020-06-03T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-04-20T22:30:00+02:00", 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2020-04-20T22:30:00+02:00", 
    "title": {
      "EN": "ERDA Web Pages not Responding", 
      "DK": "ERDA websiderne svarer ikke"
    }, 
    "services": [
      "Web"
    ], 
    "work_end": "2020-04-21T20:50:00+02:00", 
    "description": {
      "EN": "Late last night the ERDA pages requiring login stopped responding and just gave a time out. We've gotten them back online with a web service restart and are looking further into the cause. We had another case tonight and it appears it was caused by a misconfiguration in our OpenID setup. Probably introduced during the last ERDA upgrade and reboot. It was fixed now so the service should be stable again from now on.", 
      "DK": "Sent i aftes holdt de ERDA websider som kræver login op med at svare, og man fik bare en time out melding. Vi har fået liv i dem igen med en web service genstart og undersøger sagen nærmere. Til aften oplevede vi problemet igen og kunne se at det skyldtes en konfigurationsfejl i vores OpenID-opsætning - sikkert opstået ifm sidste opgradering og genstart af ERDA. Den er rettet, så servicen skulle køre stabilt igen fra nu af."
    }, 
    "announce_end": "2020-04-22T10:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-04-22T16:30:00+02:00", 
    "systems": [
      "SIF"
    ], 
    "announce_start": "2020-04-15T10:00:00+02:00", 
    "title": {
      "EN": "Planned SIF Maintenance", 
      "DK": "Planlagt SIF systemvedligehold"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-04-22T23:00:00+02:00", 
    "description": {
      "EN": "We have a number of pending upgrades of both system and SIF software which will require reboot and service restarts. The work commenced on April 22th at 16:30 and we finished the updates and restarts at 20:00. Everything should be back to normal.", 
      "DK": "Vi har en række udestående opdateringer af både system og SIF software. Disse kræver en reboot og genstart af services. Arbejdet begyndte den 22. april kl 16.30 og vi blev færdige med opgradering og genstarter kl 20.00. Alt skulle være tilbage i normal drift."
    }, 
    "announce_end": "2020-04-22T23:00:00+02:00"
  },
  {
    "status": "AUTO", 
    "work_start": "2020-04-13T10:00:00+02:00", 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2020-04-10T10:00:00+02:00", 
    "title": {
      "EN": "Planned ERDA Seafile Maintenance", 
      "DK": "Planlagt vedligehold på ERDA Seafile"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2020-04-13T12:00:00+02:00", 
    "description": {
      "EN": "We have a number of pending system and minor bugfixes on ERDA Seafile. The work will require a full Seafile system restart after the system updates. ERDA Seafile will therefore be down for shorter or longer periods during the work, but all other ERDA services should remain fully available. The work commenced on April 13th at 10 and was completed at 11 with tests indicating everything to be back online. So we don't expect further outages.", 
      "DK": "Vi har en række udestående system- og mindre funktionelle opdateringer på ERDAs Seafile. Arbejdet kræver genstart af hele Seafile systemet efter systemopdateringerne. ERDA Seafile vil derfor være utilgængelig i kortere eller længere perioder under opdateringen. Arbejdet begyndte den 13. april kl 10, og vi var færdige kl 11 med test af at alt igen er funktionelt. Så vi forventer ikke yderligere nedetid."
    }, 
    "announce_end": "2020-04-14T17:00:00+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-03-13T08:00:00+01:00", 
    "systems": [
        "ALL"
    ], 
    "announce_start": "2020-03-13T08:00:00+01:00", 
    "title": {
      "EN": "Limited Staff on-site due to COVID-19 Precautions", 
      "DK": "Nedsat lokal bemanding grundet COVID-19 forholdsregler"
    }, 
    "services": [
        "ALL"
    ], 
    "work_end": "2020-04-30T23:59:59+02:00", 
    "description": {
      "EN": "Due to the general university policies in relation to the on-going COVID-19 (Corona) virus precautions we will try to work from home as much as possible. This might affect the response time for incidents that require our presence in the data centers. We will still handle any serious incidents the next business day, if not sooner.", 
      "DK": "På grund af universitetets generelle politik om begrænset fysisk adgang under den igangværende COVID-19 (Corona) virus-trussel, arbejder vi mest muligt hjemmefra. Det kan få indflydelse på responstiderne i tilfælde af fejl eller udfald som kræver fysisk tilstedeværelse i datacentrene. Alvorlige problemer vil fortsat behandles næste arbejdsdag, hvis ikke før."
    }, 
    "announce_end": "2020-04-30T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-03-18T17:00:00+01:00", 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2020-03-11T08:00:00+01:00", 
    "title": {
      "EN": "Planned ERDA Maintenance", 
      "DK": "Planlagt vedligehold på ERDA"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-03-18T19:20:00+01:00", 
    "description": {
      "EN": "We have a number of pending system and minor feature updates on the ERDA frontend. The work will require full frontend restarts in relation to the system updates and a little additional downtime to resize a core file system. All ERDA services except Seafile will be down for shorter or longer periods. The work commenced on March 18th at about 17:00 and we finished the updates and restarts about 19:20. Everything should be back to normal.", 
      "DK": "Vi har et antal udestående system- og nogle mindre funktionelle opdateringer på ERDAs frontend. Arbejdet kræver genstart af hele frontend ifm systemopdateringerne og desuden lidt nedetid til at forstørre et centralt filsystem. Alle ERDA services bortset fra Seafile vil være nede i kortere eller længere perioder under opdateringen. Arbejdet begyndte den 18. marts omkring kl 17.00 og vi blev færdige med opgradering og genstarter omkring kl 19.20. Alt skulle være tilbage i normal drift."
    }, 
    "announce_end": "2020-03-19T16:00:00+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-08-01T00:00:00+02:00", 
    "systems": [
        "UI.ERDA"
    ], 
    "announce_start": "2019-07-31T00:00:00+02:00", 
    "title": {
      "EN": "ERDA User Interface Work", 
      "DK": "ERDA udvikling på brugergrænsefladen"
    }, 
    "services": [
        "Web"
    ], 
    "work_end": "2020-12-31T23:59:59+01:00", 
    "description": {
      "EN": "We are developing the new user interface for ERDA and some glitches may appear here as a result.", 
      "DK": "Vi er igang med at udvikle den nye brugergrænseflade til ERDA og det kan give småfejl i visningen her."
    }, 
    "announce_end": "2020-12-31T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-02-21T00:00:00+01:00", 
    "references": {
      "EN": [
        "https://kunet.ku.dk/newsroom/news/Pages/Major-service-window-at-UCPH-in-February.aspx"
      ], 
      "DK": [
        "https://kunet.ku.dk/nyhedsrum/nyheder/Sider/Servicevindue-p%C3%A5-KU.aspx"
      ]
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF", "MiGrid"
    ], 
    "announce_start": "2020-02-11T00:00:00+01:00", 
    "title": {
      "EN": "Planned Major UCPH Maintenance Weekend", 
      "DK": "Planlagt Stort KU Servicevindue"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-02-23T23:59:59+01:00", 
    "description": {
      "EN": "UCPH have announced   plans for a major service window from Friday February 21st in the afternoon to Sunday February 23rd late in the evening. ERDA/IDMC/SIF/MiGrid is not directly affected and should remain fully online. Yet, the UCPH OpenID login service may be unstable in that  period, despite their redundancies. Thus, UCPH users  may experience problems especially in relation to web login during that time frame.", 
      "DK": "KU har udmeldt   planer om et stort servicevindue fra fredag den 21. februar om eftermiddagen til søndag den 23. februar sent om aftenen. ERDA/IDMC/SIF/MiGrid er ikke direkte berørt og skulle forblive online. Ikke desto mindre vil arbejdet berøre KU OpenID login-servicen, som vi benytter. Så det kan ikke udelukkes at den del vil være ustabil i perioden. D.v.s. KU-brugere vil muligvis opleve problemer især omkring login på web i det givne tidsrum."
    }, 
    "announce_end": "2020-02-23T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-02-19T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA",
      "IDMC"
    ], 
    "announce_start": "2020-02-19T00:00:00+01:00", 
    "title": {
      "EN": "Jupyter MODI Outage", 
      "DK": "Jupyter MODI udfald"
    }, 
    "services": [
      "MODI"
    ], 
    "work_end": "2020-02-19T23:59:59+01:00", 
    "description": {
      "EN": "The MODI compute cluster resource at Jupyter went offline due to a backend network file sysem failure. It has been resolved and MODI is back online.", 
      "DK": "MODI klyngeresursen på Jupyter var nede pga en fejl i dens netværksfilsystem. Vi har fået løst problemet og MODI er tilbage i drift."
    }, 
    "announce_end": "2020-02-19T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-01-22T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "SIF"
    ], 
    "announce_start": "2020-01-22T00:00:00+01:00", 
    "title": {
      "EN": "Planned SIF Maintenance", 
      "DK": "Planlagt SIF systemvedligehold"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2020-01-22T23:59:59+01:00", 
    "description": {
      "EN": "We completed the planned upgrade of both system and SIF software between 16.00 and 22.00. All services are back to normal.", 
      "DK": "Vi har overstået den varslede opdatering af både system og SIF software  imellem 16.00 og 22.00. Alle services kører igen normalt."
    }, 
    "announce_end": "2020-01-22T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2020-01-09T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA",
      "IDMC"
    ], 
    "announce_start": "2020-01-09T00:00:00+01:00", 
    "title": {
      "EN": "DAG and MODI introduces user packages", 
      "DK": "DAG og MODI introducerer brugerspecifikke pakker"
    }, 
    "services": [
      "DAG", 
      "MODI"
    ], 
    "work_end": "2020-01-09T23:59:59+01:00", 
    "description": {
      "EN": "We updated DAG and MODI, in addition it is possible on DAG to install user packages for our Python environment by installing via pip / pip3 install --user  (as well as via install.packages in R) to one's own home directory. This means that you can now avoid having to reinstall packages every time you start a new Notebook. However, it has the limitation that the package to be imported over the network will make it significantly slower than if packages are directly installed in our Notebook image.", 
      "DK": "Vi opdaterede DAG og MODI, herefter er det muligt på DAG at installere user pakker til  vores Python miljø ved at installere via pip/pip3 install --user  (samt via install.packages i R) til ens eget hjemme bibliotek. Dette gør at man nu kan slippe for at skulle geninstallere  pakker hver gang man starter en ny Notebook. Dog har det den begrænsning at pakken skal  importeres over netværket hvilket vil gøre det væsentlig langsommere end  hvis pakker er direkte installeret i vores Notebook image."
    }, 
    "announce_end": "2020-01-09T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-12-04T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2019-12-04T00:00:00+01:00", 
    "title": {
      "EN": "Planned ERDA Maintenance", 
      "DK": "Planlagt ERDA systemarbejde"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-12-04T23:59:59+01:00", 
    "description": {
      "EN": "We migrated the ERDA frontend to faster and bigger disks to improve performance of various local operations. The migration commenced on Wednesday December 4th at about 16.50 and meant that ERDA with all services were taken offline for a while. During the maintenance window we also ran some pending DAG system updates. We finished the work within a couple of hours and everything should be back to normal.", 
      "DK": "Vi migrerede ERDAs frontend til større og hurtigere diske for at forbedre ydelsen på forskellige lokale operationer. Migreringsarbejdet begyndte onsdag den 4. december omkring kl 16.50 og betød at ERDA med alle services var utilgængelig i et stykke tid. I samme forbindelse foretog vi nogle udestående systemopdateringer på DAG. Vi færdiggjorde arbejdet i løber af et par timer og alt skulle være tilbage i normal drift."
    }, 
    "announce_end": "2019-12-04T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-11-09T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA",
      "IDMC"
    ], 
    "announce_start": "2019-11-03T00:00:00+01:00", 
    "title": {
      "EN": "Planned DAG Maintenance", 
      "DK": "Planlagt DAG vedligeholdelse"
    }, 
    "services": [
      "DAG"
    ], 
    "work_end": "2019-11-10T23:59:59+01:00", 
    "description": {
      "EN": "We completed the planned update and general hardening of the DAG service with a number of service restarts and general reconfiguration of each node. For now 5 out of 7 nodes are back to normal service with 2 being restored  before they are back to being operational.", 
      "DK": "Vi afsluttede den planlagte opdatering og generelle hærdning af DAG-tjenesten med et antal servicegenstarter og generel rekonfiguration af hver knude. I øjeblikket er 5 ud af 7 noder tilbage til normal service, hvor 2 er under gendannelse før de er tilbage til at være operationelle."
    }, 
    "announce_end": "2019-11-10T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-11-07T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "SIF"
    ], 
    "announce_start": "2019-11-07T00:00:00+01:00", 
    "title": {
      "EN": "Planned SIF Maintenance", 
      "DK": "Planlagt SIF systemvedligehold"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-11-07T23:59:59+01:00", 
    "description": {
      "EN": "We completed the planned upgrade of both system and SIF software with a reboot and some shorter service restarts between 17.20 and 18.15. All services are back to normal.", 
      "DK": "Vi har overstået den varslede opdatering af både system og SIF software med en genstart og nogle korte udfald mellem 17.20 og 18.15. Alle services kører igen normalt."
    }, 
    "announce_end": "2019-11-07T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-11-05T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2019-11-05T00:00:00+01:00", 
    "title": {
      "EN": "Planned ERDA Maintenance", 
      "DK": "Planlagt ERDA systemvedligehold"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-11-05T23:59:59+01:00", 
    "description": {
      "EN": "We completed the planned upgrade of both system and ERDA software with a reboot and some shorter service restarts between 17.25 and 18.10. All services are back to normal.", 
      "DK": "Vi har overstået den varslede opdatering af både system og ERDA software med en genstart og nogle korte udfald mellem 17.25 og 18.10. Alle services kører igen normalt."
    }, 
    "announce_end": "2019-11-05T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-09-24T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2019-09-24T00:00:00+02:00", 
    "title": {
      "EN": "Seafile Migration and Down Time", 
      "DK": "Seafile migrering og nedetid"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2019-09-24T23:59:59+02:00", 
    "description": {
      "EN": "As proclaimed in the June 26th entry we've now migrated the ERDA Seafile service for better performance and scalability. We commenced with the actual migration to the new stand-alone setup on Tuesday at 8 in the morning and the data migration and database sychronization was not complete until Wednesday morning. After additional verification and testing the service was back online Wednesday at about 11.15. The migration unfortunately means that we have to suspend the previous integration with read access to Seafile data through the standard ERDA user home. For the moment we will preserve read-only access to a snapshot of the data from right before the migration in the usual virtual seafile_readonly folder in the ERDA home folder for people using Seafile. It is meant for emergency access to data in case anybody should experience problems after the migration and we will eventually remove it. After the migration we have enabled transparent proxying of Seafile requests from the old address to the new one. So the service should remain functional with the existing configuration, but it may yield better performance to switch the client to use the new location directly. There's more information about the new address and client configuration available under the Seafile section on your ERDA Settings page. Please note that the transparent proxy does not seem to fully work for mobile devices. So if file open/download consistently fails there it is likely necessary to switch them over to the new Seafile address.", 
      "DK": "Som varslet den 26/6 har vi migreret ERDA Seafile-servicen med henblik på at forbedre dens ydelse og skalering. Vi gik igang med den endelige migrering tirsdag kl 8 og datamigreringen og efterfølgende databasesynkroniserig var først færdig onsdag morgen. Efter yderligere kontrol og test var servicen tilbage i drift onsdag omkring kl 11.15. Migreringen betyder at vi på ubestemt tid må suspendere den hidtidige integration med læseadgang til ens Seafile data fra den almindelige ERDA brugermappe. Vi beholder dog for nu læseadgang til et snapshot af data umiddelbart inden migreringen via den virtuelle seafile_readonly mappe i ERDA brugermappen for Seafile-brugere. Den kan benyttes som nødløsning hvis nogen skulle opleve problemer efter migreringen, og vi fjerner den på sigt. Efter migreringen har vi opsat gennemsigtig viderestilling af Seafile-forespørgsler fra den gamle til den nye adresse. Servicen skulle således gerne forblive funktionel med eksisterende konfigurationer, men det vil formodentlig give bedre ydelse at skifte over til den nye placering direkte. Yderligere detaljer om den nye adresse og klient-opsætning findes under Seafile på ens ERDA Settings side. Bemærk at den gennemsigtige viderestilling tilsyneladende ikke virker fuldt ud på mobile enheder, så hvis vis/hent fil fejler der, er det sandsynligvis nødvendigt at skifte dem over til den nye Seafile-adresse."
    }, 
    "announce_end": "2019-09-24T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-09-18T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "SIF"
    ], 
    "announce_start": "2019-09-18T00:00:00+02:00", 
    "title": {
      "EN": "Planned SIF Maintenance to Allow External Users", 
      "DK": "Planlagt SIF systemvedligehold mhp at tillade eksterne brugere"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-09-18T23:59:59+02:00", 
    "description": {
      "EN": "For months and months we have worked on getting mainly the legal and of course the technical infrastructure in place to allow external users on SIF. Now it is finally ready to roll out and officially approved.  Thus, it will become possible to invite external users into existing projects on SIF whenever a formal collaboration with people outside UCPH is in place. The update requires at least SIF service restarts and in general some SIF service downtime should be expected in that time frame. We began the updates on Wednesday September 18th starting from 13 and we originally expected to be done sometime before 18 o'clock. However, it turned out that the updates took longer than expected so we did not finish the actual upgrade until a bit after 22 o'clock. Today we completed the remaining verification tasks so we consider everything back in normal service.", 
      "DK": "I adskillige måneder har vi arbejdet på at få organiseret især de juridiske men også tekniske procedurer for at kunne give eksterne brugere adgang til SIF. Nu er det endelig klar og officielt godkendt til at blive sat i drift.  Det bliver derved muligt at invitere eksterne brugere ind i eksisterende projekter på SIF, når der foreligger et formelt samarbejde med folk udenfor KU. I forbindelse med opdateringern er det nødvendigt som minimum at genstarte alle SIF services og generelt må der forventes kortere eller længere SIF nedetid undervejs. Vi begyndte opdateringerne onsdag den 18. september fra kl. 13 og vi forventede oprindeligt at arbejdet ville være overstået inden kl 18. Det viste sig dog mere omfattende end ventet, så vi var først færdige med selve opdateringen lidt efter kl. 22. I dag har vi kørt de resterende verificeringsopgaver og alting er igen at betragte som i normal drift."
    }, 
    "announce_end": "2019-09-18T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-08-10T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2019-08-10T00:00:00+02:00", 
    "title": {
      "EN": "Planned UCPH System Maintenance and DOI outages", 
      "DK": "Planlagt KU systemvedligehold og DOI utilgængelighed"
    }, 
    "services": [
      "DOI"
    ], 
    "work_end": "2019-08-10T23:59:59+02:00", 
    "description": {
      "EN": "UCPH IT has informed us about planned system maintenance work in multiple areas this coming weekend (August 10th and 11th). It will render various components involved in the DOI assignment which we expose for ERDA freeze archives unavailable in that time period, but the rest of ERDA should remain unaffected.", 
      "DK": "KU IT melder om planlagt systemvedligehold i den kommende weekend (10. og 11. august). Et antal komponenter involveret i den DOI-tildeling vi eksponerer for ERDA freeze archives vil derfor ikke være tilgængelige i den periode, men resten af ERDA skulle forblive i normal drift."
    }, 
    "announce_end": "2019-08-10T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-07-30T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2019-07-30T00:00:00+02:00", 
    "title": {
      "EN": "DAG/MODI outages", 
      "DK": "DAG og MODI nede"
    }, 
    "services": [
      "DAG", 
      "MODI"
    ], 
    "work_end": "2019-07-30T23:59:59+02:00", 
    "description": {
      "EN": "We lost all contact with the DAG and MODI compute nodes on Sunday morning due to a brief general power outage. Our technicians got around to investigate and got the main DAG hosts back online Monday afternoon and MODI returned on Monday evening. The special DGX-1 GPGPU node on DAG took somewhat longer to handle but it was back online on Tuesday afternoon.", 
      "DK": "Vi mistede al kontakt til maskinerne på DAG og MODI søndag formiddag pga et omfattende strømudfald. Vores teknikere undersøgte sagen nærmere og fik de almindelige DAG maskiner tilbage i drift mandag eftermiddag og MODI kom tilbage mandag aften. Den specielle DGX-1 GPGPU maskine på DAG tog noget længere at håndtere, men den var tilbage i almindelig drift tirsdag eftermiddag."
    }, 
    "announce_end": "2019-07-30T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-07-22T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2019-07-22T00:00:00+02:00", 
    "title": {
      "EN": "Power Outage in the HPC center: DAG/MODI outages", 
      "DK": "Strømsvigt i HPC Centeret: DAG og MODI nede"
    }, 
    "services": [
      "DAG", 
      "MODI"
    ], 
    "work_end": "2019-07-22T23:59:59+02:00", 
    "description": {
      "EN": "The HPC Center was among the victims of the brief power outage or glitch on multiple campus areas at about 11 this morning. The core services are all on uninterruptible power supply (UPS) and weren't affected, but the DAG and MODI compute nodes are not covered and needed a bit of work to get back online. The affected services were all restored before 14.", 
      "DK": "HPC Centeret var blandt de ramte i strømudfaldet på flere dele af campus omkring kl 11 i formiddags. Alt centralt udstyr og services er på nødstrøm (UPS) og blev derfor ikke berørt. Beregningsmaskinerne i DAG og MODI er ikke dækket og krævede lidt arbejde at få tilbage i drift efter udfaldet. De berørte systemer var tilbage i normal drift inden kl 14."
    }, 
    "announce_end": "2019-07-22T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-07-05T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2019-07-05T00:00:00+02:00", 
    "title": {
      "EN": "Outage in the storage backend: additional service outages", 
      "DK": "Udfald i backend-lageret: efter-veer og udfald"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-07-05T23:59:59+02:00", 
    "description": {
      "EN": "There was some additional fallout after the hardware breakdown yesterday and all services had to be taken offline again for a while this morning. We are done replacing failing componens and the problems should be over. All ERDA/IDMC and SIF services are back online.", 
      "DK": "Der var opstod nogle følgeproblemer af gårsdagens hardwarenedbrud og det førte til yderligere et udfald i morges. Vi er færdige med at udskifte de problematiske komponenter og problemerne skulle være løst. Alle ERDA/IDMC og SIF services er tilbage i almindelig drift."
    }, 
    "announce_end": "2019-07-05T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-07-04T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2019-07-04T00:00:00+02:00", 
    "title": {
      "EN": "Outage in the storage backend: all services down!", 
      "DK": "Udfald i backend-lageret: alt offine!"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-07-04T23:59:59+02:00", 
    "description": {
      "EN": "We had a serious hardware breakdown in the storage backend and had to take all systems offline for emergency maintenance until replacement equipment was ready. All ERDA/IDMC and SIF services were offline, but are now back online.", 
      "DK": "Vi havde et større hardwarenedbrud i backend-lageret til eftermiddag/aften og alt måtte tages offline indtil vi havde nyt maskinel kørt i stilling. Alle ERDA/IDMC og SIF services var nede, men er nu tilbage online."
    }, 
    "announce_end": "2019-07-04T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-07-04T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "SIF"
    ], 
    "announce_start": "2019-07-04T00:00:00+02:00", 
    "title": {
      "EN": "Warning about Planned SIF Maintenance and Downtime", 
      "DK": "Varsel om planlagt systemarbejde og nedetid på SIF"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-07-04T23:59:59+02:00", 
    "description": {
      "EN": "We are physically moving the SIF frontend machine and need about an hour of downtime. The work will commence on Thursday July 4th at 10 in the morning and will temporarily remove access to  all SIF services. We expect the task to be complete and all services back online within an hour, i.e. sometime before 11. Update: the move took somewhat longer due to some pending important system updates not behaving as well as expected. We were done and back online at about 12:30.", 
      "DK": "Vi flytter SIF frontend-maskinen og har i den forbindelse brug for omkring en times nedetid. Arbejdet vil starte på torsdag den 4. juli kl 10 om formiddagen og vil midlertidigt gøre alle SIFs services utilgængelige. Vi forventer at arbejdet er overstået i løbet af en time og alt således er tilbage i normal drift inden kl 11. Opdatering: arbejdet blev forsinket af at nogle vigtige systemopdateringer ikke opførte sig helt så pænt som ventet. Vi var færdige og tilbage online omkring kl 12:30."
    }, 
    "announce_end": "2019-07-04T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-07-01T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2019-07-01T00:00:00+02:00", 
    "title": {
      "EN": "Slow/Missing Access", 
      "DK": "Begrænset/ingen adgang"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-07-01T23:59:59+02:00", 
    "description": {
      "EN": "We had an outage in the backend storage around noon affecting access to all services. The problem should now be solved and everything back to normal.", 
      "DK": "Vi havde et udfald i backend-lageret omkring middag og det berørte alle services. Problemet skulle nu være løst og alt tilbage i almindelig drift."
    }, 
    "announce_end": "2019-07-01T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-06-26T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2019-06-26T00:00:00+02:00", 
    "title": {
      "EN": "Seafile restructuring and warning about weaker integration", 
      "DK": "Seafile omstrukturering og varsel om nedsat integration"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2019-06-26T23:59:59+02:00", 
    "description": {
      "EN": "Due to a steady increase in load we're planning to migrate the ERDA Seafile service from running side-by-side with the other services on the same frontend to instead run on a stand-alone frontend. That should allow for better performance and significantly help scaling to keep up with a growing number of concurrent users in the future. At the same time it allows for a simpler and more robust backend storage than the current one. The disadvantage of the dedicated frontend is that it makes it much harder to preserve the current ERDA Files integration with transparent read-only access to your Seafile data through the seafile_readonly folder. Alas, that appears to be a necessary loss. We expect to put the new Seafile structure into production some time in August and therefore expect the ERDA Files integration to be phased out in the coming months. At the moment it is unclear if we'll be able to provide a similar integration in the future or if the Seafile service will in practice remain an independent service.", 
      "DK": "Grundet støt stigende belastning planlægger vi at omlægge ERDA Seafile servicen fra at køre på samme frontend som de andre ERDA services til i stedet at køre på sin egen dedikerede frontend. Det skulle give bedre ydelse samt markant bedre mulighed for at kunne skalere til også at kunne håndtere det stigende antal samtidige brugere i fremtiden. Desuden giver det mulighed for at bruge et simplere og mere robust backend-lager end det nuværende. Ulempen ved den udskilning er at vi så ikke længere uden videre kan tilbyde den nuværende tætte integration i ERDA Files med sømløs skrivebeskyttet adgang til ens Seafile data via seafile_readonly mappen. Det lader desværre til at være et nødvendigt offer. Vi forventer at den nye struktur vil komme i drift i løbet af august og at integrationen i ERDA Files derfor vil udfases i løbet af de kommende måneder. Det er på nuværende tidspunkt uvist om vi på sigt igen vil kunne tilbyde en sådan funktionalitet eller om Seafile fremover i praksis forbliver en helt selvstændig service."
    }, 
    "announce_end": "2019-06-26T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-05-29T00:00:00+02:00", 
    "references": {
      "EN": [
        "https://it.ku.dk/driftinfo/"
      ], 
      "DK": [
        "https://it.ku.dk/driftinfo/"
      ]
    }, 
    "systems": [
      "ALL"
    ], 
    "announce_start": "2019-05-29T00:00:00+02:00", 
    "title": {
      "EN": "UCPH Phishing Attack", 
      "DK": "KU i phishing-angreb"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-05-29T23:59:59+02:00", 
    "description": {
      "EN": "UCPH and KUMail was the target of multiple big phishing attacks recently. Please take proper precautions if you got caught and disclosed you login credentials. E.g. apart from of course changing your UCPH password also remember to change any possibly affected passwords you have set for your ERDA/IDMC/SIF/MiGrid SFTP, FTPS, WebDAVS and Seafile services. While at it we also strongly recommend enabling 2-factor authentication for your ERDA/IDMC/MiGrid logins by following the 2-Factor Auth wizard on your site Settings page. You can either use one of the common authentictor apps or the NetIQ app, which UCPH recently started promoting for various services.", 
      "DK": "KU og KUMail var mål for et større phishing-angreb på det seneste. Tag venligst dine forholdsregler såfremt du var blandt de fuppede og dermed videregav dine login-oplysninger. D.v.s. husk udover naturligvis at skifte dit KU-kodeord også at skifte evt berørte koder du måtte have valgt for dine ERDA/IDMC/SIF/MiGrid SFTP, FTPS, WebDAVS og Seafile services. Ved samme lejlighed vil vi kraftigt anbefale at tilvælge 2-faktor godkendelse på dine ERDA/IDMC/MiGrid-logins ved at følge 2-Factor Auth guiden på din site Settings side. Du kan vælge  mellem at benytte en af de populære authentictor apps eller benytte den NetIQ app, som KU for nyligt er begyndt at promovere til forskellige services."
    }, 
    "announce_end": "2019-05-29T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-05-14T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2019-05-14T00:00:00+02:00", 
    "title": {
      "EN": "Login and Access Issues", 
      "DK": "Problemer med login og adgang"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-05-14T23:59:59+02:00", 
    "description": {
      "EN": "We experienced new login and access problems since before noon today. This time it was apparently an issue where our web server and our Jupyter instances ended up in a fight for resources and significanlty limited the chances of ordinary web browser access. After some clean up, tuning and service restarts things are running as expected again.", 
      "DK": "Vi oplevede nye problemer med web-login/adgang her omkring middag.  Denne gang var det så vidt vi har kunnet finde frem til et problem med at vores web-server og Jupyter instanserne endte i en amoktilstand og slugte alle resurser, så man dårligt kunne komme igennem med almindlige web browsere. Efter lidt oprydning, tuning og genstart af services ser det ud til at være løst og tilbage i normal drift."
    }, 
    "announce_end": "2019-05-14T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-05-10T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2019-05-10T00:00:00+02:00", 
    "title": {
      "EN": "Jupyter Outage", 
      "DK": "Jupyter nede"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-05-10T23:59:59+02:00", 
    "description": {
      "EN": "We had a power outage in the HPC center today and the Jupyter nodes went offline as a result. DAG was back online a bit after noon and MODI followed a little later.", 
      "DK": "Vi oplevede en strømafbrydelse i HPC centeret og Jupyter maskinerne var derfor nede. DAG kom tilbage online efter middag og MODI fulgte ikke så længe efter."
    }, 
    "announce_end": "2019-05-10T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-04-23T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF", "MiGrid"
    ], 
    "announce_start": "2019-04-23T00:00:00+02:00", 
    "title": {
      "EN": "Login and Access Issues Again", 
      "DK": "Problemer med KU-login og adgang igen"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-04-23T23:59:59+02:00", 
    "description": {
      "EN": "It looks like the UCPH OpenID issues have returned this morning. We've contacted University IT about the issue and await a solution. Since noon it seems to be back to normal but we're monitoring it.", 
      "DK": "Det ser desværre ud til at problemet med KU-login er vendt tilbage her til formiddag. Vi har kontaktet KUIT og de ser på sagen. Det ser ud til at være tilbage ved normal drift igen siden middag, men vi holder øje med sagen."
    }, 
    "announce_end": "2019-04-23T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-03-27T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF", "MiGrid"
    ], 
    "announce_start": "2019-03-27T00:00:00+01:00", 
    "title": {
      "EN": "Login and Access Issues", 
      "DK": "Problemer med KU-login og adgang"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-03-27T23:59:59+01:00", 
    "description": {
      "EN": "This morning from about 10.30 UCPH users experienced various issues especially with ERDA web use. Every operation involving actual login or just login session checks took a long time and some times so long that it resulted in a page load timeout and various other page navigation errors. We tracked it down to be a problem with the UCPH OpenID service, which we rely on for UCPH login to ERDA/IDMC/SIF/MiGrid. University IT had a look and got it back to normal. So everything should be fully functional again.", 
      "DK": "Til formiddag fra omkring kl 10.30 oplevede KU-brugere forskellige problemer med især ERDA webadgang. Alle operationer som involverede enten login eller kontrol af aktiv login session tog enormt lang tid, og førte nogle gange ligefrem til timeout og forskellige andre sideindlæsningsfejl. Vi fandt frem til at det var et problem med svartiderne fra KUs OpenID service, som vi benytter til at levere KU-login på ERDA/IDMC/SIF/MiGrid. KUIT kiggede nærmere på det og fik servicen tilbage i normal drift. Alt skulle derfor være fuldt ud funktionelt igen."
    }, 
    "announce_end": "2019-03-27T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-02-06T00:00:00+01:00", 
    "references": {
      "EN": [
        "http://sif.ku.dk"
      ], 
      "DK": [
        "http://sif.ku.dk"
      ]
    }, 
    "systems": [
      "SIF"
    ], 
    "announce_start": "2019-02-06T00:00:00+01:00", 
    "title": {
      "EN": "SIF Efficient Data Access", 
      "DK": "SIF Effektiv dataadgang"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-02-06T23:59:59+01:00", 
    "description": {
      "EN": "Finally efficient file and folder access through WebDAVS and SFTP has arrived for SIF. The services already used in ERDA had to be extended to include detailed logging of every single access and file operation. For higher security we've added twofactor auth and made it mandatory on SIF. Finally we implemented additional restrictions for the services on SIF, so that users can only access a single project at a time and only from a single IP address there. This is in line with the existing data leak prevention mechanisms enforced for SIF web access. Please note that on SIF therefore both services require a previous web login with twofactor auth for additional security. Apart from that the same features are available, so that users can use SIF as a network drive with similar setup as for ERDA. Please refer to Efficient Data Access sections in the user guide from the  SIF front page for additional information.", 
      "DK": "SIF har langt om længe også fået effektiv dataadgang gennem WebDAVS og SFTP. De tilsvarende services har længe været tilgængelige på ERDA, men måtte udbygges til at logge hver eneste adgang og filoperation. For yderligere sikring har vi tilføjet to-faktor godkendelse og gjort det obligatorisk dor dem på SIF. Endelig implementerede vi yderligere restriktioner for de to services på SIF, så brugere kun kan tilgå netop et projekts data af gangen, og kun fra en enkelt IP-adresse. Det er helt i tråd med de eksisterende mekanismer til at sikre mod datalæk på SIFs web-adgang. Bemærk at begge services på SIF derfor kræver et forudgående web-login med to-faktor godkendelse for yderligere sikkerhed. Derudover tilbydes de samme features, så brugere kan benytte SIF som et netværksdrev. Vi henviser til afsnittet om Effektiv datatilgang i brugervejledningen fra SIF forsiden for yderligere information."
    }, 
    "announce_end": "2019-02-06T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-01-21T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2019-01-21T00:00:00+01:00", 
    "title": {
      "EN": "Planned Maintenance - Expected Downtime", 
      "DK": "Vedligehold og planlagt nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2019-01-21T23:59:59+01:00", 
    "description": {
      "EN": "We've completed the planned upgrade of the software stack on ERDA and IDMC frontends with some pending security and general bug fixes. The work began at about 18 and included a reboot of the frontend. Thus all services were affected with some minutes of outage.", 
      "DK": "Vi har gennemført den planlagte opgradering af ERDA og IDMC frontends med nogle sikkerheds- og generelle fejlrettelser. Arbejdet startede omkring kl 18 og inkluderede genstart af frontends. D.v.s. alle services har været berørt, og der var nogle minutters nedetid."
    }, 
    "announce_end": "2019-01-21T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2019-01-17T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF", "MiGrid"
    ], 
    "announce_start": "2019-01-17T00:00:00+01:00", 
    "title": {
      "EN": "Web Access/Login Downtime and subsequent fallouts", 
      "DK": "Web adgang og login fejl"
    }, 
    "services": [
      "Web"
    ], 
    "work_end": "2019-01-17T23:59:59+01:00", 
    "description": {
      "EN": "We experienced errors related to authentication and generel Web access between 13:00 and 15:00. The initial fallout was due to errors in authenticating against KU's OpenID service. After this had been resolved and the service had settled for a while,  subsequent authenticated users via the OpenID service experienced request failures both in accessing ERDA and the Jupyter service. This was discovered being due to a flood of failed requests from re-authenticated users accessing previously created Jupyter servers. This was resolved by reseting the old Jupyter servers. For now this has stabilized both ERDA and Jupyter, however we will continue to monitor  the situtation if subsequent failures should arise.", 
      "DK": "Vi oplevede fejl i forbindelse med login og generel web-adgang mellem kl. 13.00 og 15.00. Dette oprindelige udfald skyldtes fejl i autentificering mod KUs OpenID-tjeneste. Efter dette var overstået var tjeneste stabil i et stykke tid. Dog fulgte et senere udfald, specifikt med fejlende forespørgsler  mod både ERDA og Jupyter for KU OpenID autentificerede brugere. Dette skyltes at gen-autentificerede OpenID brugere der tidligere havde  startet en Jupyter server forårsagede fejlende forespørgsler fra deres gamle  Jupyter server både til og fra ERDA. Dette blev løst ved at nulstille de gamle Jupyter-servere.  For nuværende har dette stabiliseret både ERDA og Jupyter, vi vil dog fortsat overvåge situationen i tilfælde af flere fejl skulle følge."
    }, 
    "announce_end": "2019-01-17T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-09-09T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ], 
    "announce_start": "2018-09-09T00:00:00+02:00", 
    "title": {
      "EN": "Import Share Links", 
      "DK": "Import share links"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-09-09T23:59:59+02:00", 
    "description": {
      "EN": "By request from users we added a feature to allow easy import of data from Share Links into your own ERDA/IDMC/MiGrid folders. From your Files page you can right click a folder and choose Share Link > Import. Then enter/paste the ID or URL of the Share Link and click Ok to proceed with complete import of all shared data directly into the folder. In case you only want to import a particular file or folder from the Share Link you can replace the '*' in the Source Path field with your desired target before you click Ok. In any case the effect is that you get your own copy of the data directly in your chosen folder.", 
      "DK": "Efter ønske fra flere brugere har vi tilføjet funktionalitet til nemt at hente data delt på et Share Link ind i dine egne mapper på ERDA/IDMC/MiGrid. Fra Files kan du højreklikke på en folder og vælge Share Links > Import. Indtast/indsæt ID eller URL på det pågældende Share Link og klik Ok for at starte import af al data derfra direkte ind i den valgte folder. I tilfælde af at du kun ønsker at hente en enkel fil eller folder fra Share Linket kan du erstatte '*' i Source Path med navnet på denne før du klikker Ok. Uanset er resultatet at du får din egen kopi af data i den valgte folder."
    }, 
    "announce_end": "2018-09-09T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-09-08T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-09-08T00:00:00+02:00", 
    "title": {
      "EN": "Planned Jupyter Maintenance - Expected Downtime", 
      "DK": "Jupyter vedligehold og planlagt nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-09-08T23:59:59+02:00", 
    "description": {
      "EN": "We've upgraded the Jupyter service at ERDA/IDMC as planned this weekend. It required some Jupyter downtime especially on Saturday and additional shorter inavailability periods on Sunday. All other services ran unaffected. The maintenance was finished at 00:10 on the 10th of September yielding a new clustered setup of 6 physical hosts delivering the Jupyter service. Beyond that the systems were updated and configured to allow for up to 8 cores and 8 GB of memory available to the individual notebooks, while always providing at least 1 core and 1 GB of memory even during congested periods. Everything at this point looks good and we expect normal Jupyter operation - only now with better scalability.", 
      "DK": "Vi opgraderede som planlagt Jupyter servicen på ERDA/IDMC i weekenden. Det indebar nedetid på Jupyter især lørdag, samt kortere udfald og begrænset adgang dertil søndag. Ingen andre services var berørt af arbejdet. Vedligeholdet blev færdigt den 10. september kl 0:10 hvorefter Jupyter servicen leveres fra en klynge af 6 fysiske maskiner. De blev ved samme lejlighed opdateret og konfigureret til at tillade op til 8 CPU-kerner og 8 GB hukommelse til hver notebook. Selv i belastede perioder er der altid garanteret 1 kerne og 1 GB hukommelse. Alting ser fint ud og vi forventer normal drift på Jupyter servicen - nu bare med bedre skalering."
    }, 
    "announce_end": "2018-09-08T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-09-03T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2018-09-03T00:00:00+02:00", 
    "title": {
      "EN": "Planned Maintenance - Expected Downtime", 
      "DK": "Vedligehold og planlagt nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-09-03T23:59:59+02:00", 
    "description": {
      "EN": "We've upgraded the backend storage software with some bug fixes and prepared to add more disk space. The work began at 13 and resulted in general service outages until about 14 due to low level upgrades. Everything should be back to normal for ERDA/IDMC. On SIF we ran into some problems with the host which required additional work, but it is also back online now.", 
      "DK": "Vi opgraderede backend-lageret med nogle fejlrettelser og forberedte tilføjelse af mere diskplads. Arbejdet startede kl 13 og medførte generel nedetid på services indtil kl 14 pga grundlæggende systemopgraderinger. Alt skulle være tilbage i normal drift på ERDA/IDMC. På SIF oplevede vi nogle problemer som krævede lidt ekstra arbejde men den er også tilbage i almindelig drift nu."
    }, 
    "announce_end": "2018-09-03T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-07-18T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-07-18T00:00:00+02:00", 
    "title": {
      "EN": "Jupyter back online", 
      "DK": "Jupyter vedligehold og nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-07-18T23:59:59+02:00", 
    "description": {
      "EN": "The Jupyter upgrades on Friday turned out to be more work than expected and required some more work this week. It is complete now and the service is back online.", 
      "DK": "Jupyter-opdateringerne i fredags viste sig mere omfattende end ventet og krævede yderligere indsats i denne uge. Det er nu overstået og servicen er online igen."
    }, 
    "announce_end": "2018-07-18T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-07-12T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-07-12T00:00:00+02:00", 
    "title": {
      "EN": "Jupyter maintenance and downtime", 
      "DK": "Jupyter vedligehold og nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-07-12T23:59:59+02:00", 
    "description": {
      "EN": "The Jupyter service will be partially or completely unavailable for the rest of the day due to maintenance work and upgrades.", 
      "DK": "Jupyter-servicen vil være helt eller delvis utilgængelig resten af dagen pga vedligehold og opgradering."
    }, 
    "announce_end": "2018-07-12T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-07-06T00:00:00+02:00", 
    "references": {
      "EN": [
        "https://intranet.ku.dk/employeeguide/safety-and-emergency/information-security/Pages/default.aspx", 
        "http://sif-www.erda.dk"
      ], 
      "DK": [
        "https://intranet.ku.dk/medarbejderguide/sikkerhed-og-beredskab/IS/Sider/default.aspx", 
        "http://sif-www.erda.dk"
      ]
    }, 
    "systems": [
      "ALL"
    ], 
    "announce_start": "2018-07-06T00:00:00+02:00", 
    "title": {
      "EN": "2-Factor Authentication Support", 
      "DK": "Understøttelse af 2-faktor autentifikation"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-07-06T23:59:59+02:00", 
    "description": {
      "EN": "In line with the recent IO-service security enhancements we've added support for 2-factor authentication (2FA) in our OpenID web logins. This means that users can now add an extra layer of security and make abuse much harder - even if somebody should intercept their UCPH login and password (or their dedicated ERDA OpenID password in case of external users). In short you as a security-minded user install an app on your mobile device (smart-phone or tablet) and scan a personal QR security code, which allows the app to continuously provide you with one-time passcodes for use along with your usual login. This assures that one can only get access by both knowing the password and possessing the device. Further details about the setup and use of 2FA is available under ERDA Setttings -> Web Access. We particularly recommend enabling 2FA if you use ERDA for any data categorized as confidentiality level F2 in the official UCPH data classification available at the   UCPH intranet (requires login). It should be emphasized that data confidentiality level F1 is not allowed on ERDA and should instead use an even safer and more closely monitored solution like e.g. SIF. We are currently investigating the possibilities for similar 2FA support on the IO-services.", 
      "DK": "Som opfølgning på de nylige sikkerhedstiltag ift IO-services har vi tilføjet 2-faktor autentifikation (2FA) på vores OpenID web logins. I praksis betyder det at brugere nu kan tilføje et ekstra sikkerhedslag, hvorved kontomisbrug bliver markant sværere - selv hvis nogen skulle opsnappe deres KU login og kode (eller deres dedikerede ERDA login når vi taler eksterne brugere). Kort fortalt installerer man som sikkerhedsbevidst bruger en app på sin mobile enhed (smart-phone eller tablet) og skanner en personlig QR sikkerhedskode deri, for at få den til kontinuerligt at levere engangskoder til brug sammen med sit almindelige login. Derved sikres at man kun kan få adgang, hvis man både kender kode og har adgang til enheden. Yderligere detaljer om opsætning og brug findes under dine ERDA Settings -> Web Access. Vi anbefaler kraftigt at slå 2FA til, hvis man benytter ERDA til at opbevare data kategoriseret som fortrolighedsniveau F2 i den officielle KU dataklassifikation fra   KUnet (kræver login). Ved samme lejlighed må vi understrege at data kategoriseret som fortrolighedsniveau F1 ikke er tilladt at opbevare på ERDA. Brug i stedet en endnu sikrere og tættere monitoreret løsning som f.eks. SIF dertil. Vi undersøger i øjeblikket muligheden for ligeledes at tilbyde 2FA på vores IO-services."
    }, 
    "announce_end": "2018-07-06T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-06-25T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ], 
    "announce_start": "2018-06-25T00:00:00+02:00", 
    "title": {
      "EN": "Password tightening on WebDAVS/SFTP/FTPS", 
      "DK": "Strengere password-krav på WebDAVS/SFTP/FTPS"
    }, 
    "services": [
      "SFTP", 
      "WebDAVS", 
      "FTPS", 
      "Web"
    ], 
    "work_end": "2018-06-25T23:59:59+02:00", 
    "description": {
      "EN": "Due to a rise in the number of automated password guessing attempts we've chosen to strengthen the password requirements for our services with password-login. This means that since yesterday we enforce not only the standard UCPH password requirements of eight characters from at least three character classes but also a number of additional checks for dictionary words and simple patterns. The rules were immediately enforced when setting or changing password and will also be enforced for existing passwords next time we restart the services. In case you can no longer access ERDA/IDMC/MiGrid through WebDAVS/SFTP/FTPS, please go to your Settings page and try to set the password again for the particular service. If it is refused you need to come up with a new stronger password.", 
      "DK": "I lyset af det stigende antal angreb som forsøger at knække passwords til vores WebDAVS/SFTP/FTPS-services, har vi yderligere strammet kravene til styrken af passwords. Udover de almindelige KU-krav om otte tegn fra mindst tre tegn-klasser har vi således indført hindring af passwords med almindelige ord eller simple fortløbende tegnsekvenser og møsntre. Stramningerne trådte i kraft med det samme for password-opsætning og -skift. De vil desuden blive håndhævet for eksisterende passwords når vi næste gang genstarter services. Såfremt du ikke længere kan logge på de pågældende services på ERDA/IDMC/MiGrid, kan du gå ind på din Settings side og prøve at sætte kodeordet igen. Hvis det afvises er du nødt til at finde på et nyt og stærkere kodeord."
    }, 
    "announce_end": "2018-06-25T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-06-21T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ALL"
    ], 
    "announce_start": "2018-06-21T00:00:00+02:00", 
    "title": {
      "EN": "Rate limit SFTP logins", 
      "DK": "SFTP rate-limit"
    }, 
    "services": [
      "SFTP"
    ], 
    "work_end": "2018-06-21T23:59:59+02:00", 
    "description": {
      "EN": "Due to a rise in the number of automated password guessing attempts we've implemented further rate limits on apparent attackers at our SFTP service. This means that too many failed login attempts result in automatic temporary banning of the IP address for a while. Please contact us if you run into problems with your connections and transfers.", 
      "DK": "Vi har indført ydeligere automatiske værn mod det stigende antal automatiske forsøg på at gætte SFTP passwords. Det betyder i praksis at vi automatisk midlertidigt lukker for adgang fra IPer der udviser tegn på sådanne angreb. Kontakt os venligst hvis du oplever problemer med login eller overførsler på SFTP-servicen."
    }, 
    "announce_end": "2018-06-21T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-06-20T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2018-06-20T00:00:00+02:00", 
    "title": {
      "EN": "Planned Maintenance - Expected Downtime", 
      "DK": "Vedligehold og planlagt nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-06-20T23:59:59+02:00", 
    "description": {
      "EN": "We've upgraded the backend storage software to a more recent version in order to apply a number of bug fixes. This should include stability fixes related to the occasional connection losses we've seen during the last year. The work began at 9 and all systems were offline until we finished the upgrade at about 12:30. Everything looks good so far and we expect things to be back to normal now.", 
      "DK": "Vi har opgraderet backend-lageret til en nyere version med en stribe fejlrettelser. Derunder bl.a. nogle stabilitets-forbedringer som gerne skulle afhjælpe de periodiske udfald vi har oplevet indenfor det seneste års tid. Arbejdet startede kl 9 og medføre at alle services var nede indtil vi var færdige henved kl 12:30. Alt ser fint ud så langt og vi regner med normal drift igen nu."
    }, 
    "announce_end": "2018-06-20T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-06-18T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-06-18T00:00:00+02:00", 
    "title": {
      "EN": "Short inaccessibility", 
      "DK": "Kort udfald"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-06-18T23:59:59+02:00", 
    "description": {
      "EN": "We had a hiccup on the frontend this morning and had to restart all services. While at it we forced a pending reboot. Everything should be back to normal again.", 
      "DK": "Vi oplevede et problem med frontend til morgen og måtte genstarte alle services. Ved samme lejlighed indskød vi en udestående system genstart. Alt skulle være tilbage i normal drift igen."
    }, 
    "announce_end": "2018-06-18T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-06-13T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-06-13T00:00:00+02:00", 
    "title": {
      "EN": "New DOI Integration", 
      "DK": "Ny DOI-integration"
    }, 
    "services": [
      "DOI"
    ], 
    "work_end": "2018-06-13T23:59:59+02:00", 
    "description": {
      "EN": "University IT has put their new Digital Object Identifier (DOI) registration service in production and we have integrated it with ERDA freeze archives. This means that it is now possible to get a short and permanent DOI reference to ERDA archive data - something a number of organizers and funders have started to require when publishing research results.", 
      "DK": "KU-IT har åbnet op for en ny service til Data Object Identifier (DOI) registrering og vi har integreret den med ERDA freeze archives. Det betyder at man nu kan få registreret en kort og permanent reference til sine arkiverede data i ERDA - noget som er blevet et mere udbredt krav fra organisatorer og finansiører ifbm publicering af videnskabelige resultater."
    }, 
    "announce_end": "2018-06-13T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-04-19T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-04-19T00:00:00+02:00", 
    "title": {
      "EN": "Partial Data Access and Seafile down", 
      "DK": "Delvis dataadgang og Seafile nede"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2018-04-19T23:59:59+02:00", 
    "description": {
      "EN": "We've seen additional connection losses to the backend storage servers and had to restart services to recover. Seafile required extra maintenance, which should be resolved now.", 
      "DK": "Vi har oplevet flere udfald i forbindelsen til vores backend lager, og har måttet genstarte services. Seafile krævede yderligere vedligehold, men det skulle være løst nu."
    }, 
    "announce_end": "2018-04-19T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-04-17T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-04-17T00:00:00+02:00", 
    "title": {
      "EN": "Partial Data Access", 
      "DK": "Delvis dataadgang"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-04-17T23:59:59+02:00", 
    "description": {
      "EN": "We lost the connection to one or more backend storage servers and the result was limited data access in all services. Everything is back online and we're closely monitoring the systems. Additionally we're planning an upgrade to the glusterfs software providing the link to the backend storage. It should address a number of issues related to the problems we've seen lately with connection loss.", 
      "DK": "Vi mistede forbindelsen til en eller flere af vores backend servere, så dataadgangen faldt delvis ud. Alt er tilbage i almindelig drift, og vi overvåger for at fange evt yderligere problemer. Vi planlægger desuden en opgradering af glusterfs softwaren, som leverer forbindelsen til backend storage. Det skulle gerne hjælpe på de problemer vi har set på det seneste med udfald."
    }, 
    "announce_end": "2018-04-17T23:59:59+02:00"
  }, 
  {
    "status": "AUTO",
    "work_start": "2018-04-06T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-04-06T00:00:00+02:00", 
    "title": {
      "EN": "Enabling Workgroup Workflows again", 
      "DK": "Genindførsel af workgroup workflows"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-04-06T23:59:59+02:00", 
    "description": {
      "EN": "We have optimized our Workgroup Workflows service to be far less taxing on the system and thus we have enabled it in production again.", 
      "DK": "Vi har optimeret Workgroup Workflows servicen så den nu er langt mindre belastende for systemet og har derfor sat den i drift igen."
    }, 
    "announce_end": "2018-04-06T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-03-16T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "SIF"
    ], 
    "announce_start": "2018-03-16T00:00:00+01:00", 
    "title": {
      "EN": "Partial Data Access and Login Problems", 
      "DK": "Delvis dataadgang og loginproblemer"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-03-16T23:59:59+01:00", 
    "description": {
      "EN": "We had a CPU-lockup on one of our backend storage servers. Everything is back online and we're closely monitoring the systems.", 
      "DK": "Vi havde et CPU-lockup på en af vores backend servere.  Alt er tilbage i almindelig drift, men vi holder tæt øje med systemerne i tilfælde af at problemerne skulle komme tilbage."
    }, 
    "announce_end": "2018-03-16T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-03-15T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-03-15T00:00:00+01:00", 
    "title": {
      "EN": "Temporarily Disabling Workgroup Workflows", 
      "DK": "Midlertidig nedtagning af workgroup workflows"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-03-15T23:59:59+01:00", 
    "description": {
      "EN": "We have a hunch that our Workgroup Workflows service had a negative impact on the problems we saw recently after the disk failure and replacement. Therefore we have chosen to temporarily disable it at ERDA. In case you were using it for automated backup as described in the user guide, you can either switch it over to the new Schedule Tasks service or contact us for a temporary replacement. Our plan is to enable workflows again once we have optimized the service to be significantly less resource intensive.", 
      "DK": "Vi har en mistanke om at Workgroup Workflows servicen har haft en negativ indvirkning på de problemer vi oplevede efter diskskiftet forleden. Vi har derfor valgt midlertidigt at slå den fra på ERDA. Såfremt du er afhængig af den til automatisk backup jvf brugervejledningen, kan du enten skifte til den nye Planlagte Opgaver / Schedule Tasks service eller henvende dig til os for en midlertidig erstatning. Planen er at vi sætter workflows i drift igen når vi har fået servicens lagerovervågning optimeret til at være væsentlig mindre resurseintensiv."
    }, 
    "announce_end": "2018-03-15T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-03-12T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-03-12T00:00:00+01:00", 
    "title": {
      "EN": "Partial Data Access and Login Problems", 
      "DK": "Delvis dataadgang og loginproblemer"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-03-12T23:59:59+01:00", 
    "description": {
      "EN": "We had a disk crash last night and needed a physical replacement. As a result we only had partial data visibility, meaning that some files would appear missing even though they were actually intact. For some users this happened to be important login files, in effect preventing log in. We solved the disk problems but had a few hiccups with lost connections to the backend storage throughout the day. Each time the  result was similar partial visibility and login problems for some users. Everything is back online and we're closely monitoring the systems.", 
      "DK": "Vi havde et disk-crash i nat og det krævede et fysisk diskskift. Resultatet var delvis datasynlighed, så en stribe filer så ud til at mangle selv om de faktisk var intakte. For brugere hvor centrale loginfiler var ramt, betød det at login blev afvist. Efter at have løst diskproblemerne oplevede vi desværre af flere omgange mistet forbindelse til backend-lageret med samme effekt ift login og delvis dataadgang. Alt er tilbage i almindelig drift, men vi holder tæt øje med systemerne i tilfælde af at problemerne skulle komme tilbage."
    }, 
    "announce_end": "2018-03-12T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-03-11T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-03-11T00:00:00+01:00", 
    "title": {
      "EN": "Data Access Problems", 
      "DK": "Problemer med dataadgang"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-03-11T23:59:59+01:00", 
    "description": {
      "EN": "The issues from a week ago re-appeared and we had to manually intervene to get everything back online. This resulted in partial data access and some temporary service outages.", 
      "DK": "Problemerne fra for en uge siden dukkede op igen og vi var nødt til manuelt at intervenere for at få alt tilbage i almindelig drift. Det medførte delvis dataadgang og midlertidige udfald i diverse services."
    }, 
    "announce_end": "2018-03-11T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-03-05T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ], 
    "announce_start": "2018-03-05T00:00:00+01:00", 
    "title": {
      "EN": "Schedule Tasks Feature in Beta", 
      "DK": "Planlagte opgaver (Schedule Tasks) i beta"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-03-05T23:59:59+01:00", 
    "description": {
      "EN": "We have enabled a new feature to schedule tasks in beta test at ERDA/IDMC/MiGrid. It can be used to automate tasks at given times, running on behalf of you. One such task would be the creation of backup archives e.g. every night. Further details about use and possibilities are available in the user guide.", 
      "DK": "Vi har sat den nye funktionalitet til planlagte opgaver i beta-test på ERDA/IDMC/MiGrid. Med den kan man automatisere opgaver til at køre på givne tidspunkter og på ens vegne. Det kan f.eks. være sådan noget som automatisk oprettelse af backup arkiver hver nat. De nærmere detaljer om brugen findes i brugervejledningen."
    }, 
    "announce_end": "2018-03-05T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-03-04T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC"
    ], 
    "announce_start": "2018-03-04T00:00:00+01:00", 
    "title": {
      "EN": "Data Access Errors and a Restart", 
      "DK": "Problemer med dataadgang og en genstart"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-03-04T23:59:59+01:00", 
    "description": {
      "EN": "We experienced connection issues between the frontend and backend storage resulting in e.g. directory removals failing. We had to re-establish the backend connection and restart all services to solve the problems, and everything should be back to normal again.", 
      "DK": "Vi oplevede forbindelsesproblemer mellem vores frontend og backend-lageret, hvilket bl.a. førte til fejl ved sletning af mapper. Vi genetablerede forbindelsen og genstartede alle services som løsning, og alt skulle være tilbage i normal drift igen."
    }, 
    "announce_end": "2018-03-04T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-02-21T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-02-21T00:00:00+01:00", 
    "title": {
      "EN": "Seafile Upgrade", 
      "DK": "Seafile opgradering"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2018-02-21T23:59:59+01:00", 
    "description": {
      "EN": "We upgraded our Seafile installation to receive a number of bug fixes including one reported by some of you (thanks!). Namely that the Seafile web interface consistently failed to display files with either space or exotic characters in their file name or full path. Everything should be back online again after the upgrade and service restart.", 
      "DK": "Vi opgraderede vores Seafile-installation for at få en stribe rettelser ind, inklusive én vi har fået fejlmeldinger om fra jer (tak!). Mere specifikt drejede det sig om at Seafile web-interfacet ikke ville vise filer som enten indeholdt mellemrum eller eksotiske tegn i deres navn eller fulde sti. Alting skulle være tilbage i normal drift nu efter opgradering og tilhørende genstart af servicen."
    }, 
    "announce_end": "2018-02-21T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-02-13T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-02-13T00:00:00+01:00", 
    "title": {
      "EN": "High-performance SFTP Service in General Use", 
      "DK": "Optimeret SFTP i generel drift"
    }, 
    "services": [
      "SFTP"
    ], 
    "work_end": "2018-02-13T23:59:59+01:00", 
    "description": {
      "EN": "After some months in beta test at sftp.erda.dk we've enabled our new high-performance SFTP service on the standard io.erda.dk address. We've measured speedups ranging from 10 to 32 times for transfers on a fast network link to ERDA. Even on slower networks you are likely to see improvements.", 
      "DK": "Efter nogle måneder i beta-test på sftp.erda.dk har vi nu integreret den samme nye højtydende SFTP service på den almindelige io.erda.dk adresse. I vores egne tests har vi observeret 10 til 32 gange bedre hastighed over hurtige netværksforbindelser til ERDA. Selv på langsommere forbindelser skulle man dog også gerne opleve tydelige forbedringer."
    }, 
    "announce_end": "2018-02-13T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-02-12T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-02-12T00:00:00+01:00", 
    "title": {
      "EN": "Slow-down / Service Outages", 
      "DK": "Langsom adgang / nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-02-12T23:59:59+01:00", 
    "description": {
      "EN": "All services were extremely slow this morning due to a disk issue on the frontend node. In some cases it resulted in connections timing out. The problem is solved and everything should be back to normal again. In the afternoon it turned out that Seafile did not like the aforementioned outage and needed a bit of additional cleaning up to run properly. It is back to normal now.", 
      "DK": "Alle services var ekstremt langsomme her til morgen pga et diskproblem på frontend-maskinen. I nogle tilfælde førte det til at forbindelser til ERDA fik time-out. Problemet er rettet og alt skulle være tilbage i normal drift igen. Seafile kunne tilsyneladende ikke lide førnævnte problem og krævede lidt ekstra oprydning. Den er ligeledes tilbage i almindelig drift nu."
    }, 
    "announce_end": "2018-02-12T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-01-25T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-01-25T00:00:00+01:00", 
    "title": {
      "EN": "Maintenance and Brief Service Outage", 
      "DK": "Vedligehold og kort nedetid"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-01-25T23:59:59+01:00", 
    "description": {
      "EN": "All services were briefly down for scheduled software updates. These included a number of minor bugfixes plus optimizations in relation to not wasting resources on automated attacks from the Internet - such as password guessing attempts. Everything should be back to normal again.", 
      "DK": "Alle services var kortvarigt nede i forbindelse med en planlagt software-opdatering. Udover en række mindre fejlrettelser dækkede den hovedsageligt optimeringer i forhold til ikke at spilde unødige resurser på automatiserede angreb fra internettet - herunder især forsøg på at gætte kodeord. Alt skulle være tilbage i normal drift igen."
    }, 
    "announce_end": "2018-01-25T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-01-10T00:00:00+01:00", 
    "references": {
      "EN": [
        "https://meltdownattack.com/"
      ], 
      "DK": [
        "https://meltdownattack.com/"
      ]
    }, 
    "systems": [
      "ALL"
    ], 
    "announce_start": "2018-01-10T00:00:00+01:00", 
    "title": {
      "EN": "Important Security Upgrades", 
      "DK": "Vigtige sikkerhedsopdateringer"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-01-10T23:59:59+01:00", 
    "description": {
      "EN": "We finished applying a set of urgent security updates in relation to the Meltdown and Spectre security issues. This involved a reboot for kernel updates and thus a resulting brief general outage for all services.", 
      "DK": "Vi færdiggjorde en stribe sikkerhedsopdateringer som følge af  Meltdown og Spectre sikkerhedshullerne. Det var nødvendigt at genstarte systemer for at få tilhørende kerneopdateringer i drift, og vi havde derfor kortvarigt generel nedetid på alle services."
    }, 
    "announce_end": "2018-01-10T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2018-01-10T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2018-01-10T00:00:00+01:00", 
    "title": {
      "EN": "Partial data visibility", 
      "DK": "Delvis datasynlighed"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2018-01-10T23:59:59+01:00", 
    "description": {
      "EN": "Our active frontend node lost sight of a number of files on the backend storage nodes. This in particular resulted in one or more workgroup folders not showing up in the user file space. No data was lost and a reload of the storage connection fixed the problem.", 
      "DK": "Vores aktive frontend-maskine tabte adgang til et antal filer på backend-lageret. Som følge deraf blev en eller flere delte workgroup-mapper midlertidigt usynlige for deltagerne. Ingen data blev tabt og genetablering af forbindelsen til backend-lageret løste problemet."
    }, 
    "announce_end": "2018-01-10T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2017-11-02T00:00:00+01:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2017-11-02T00:00:00+01:00", 
    "title": {
      "EN": "System Outage and Seafile Data Loss", 
      "DK": "Systemudfald og delvist datatab i Seafile"
    }, 
    "services": [
      "Seafile"
    ], 
    "work_end": "2017-11-02T23:59:59+01:00", 
    "description": {
      "EN": "We experienced a massive system outage due to a disk and a CPU failing hard in turn. This left part of our systems offline for most of a day until we had restored and migrated the tasks to another host. On the good side ordinary ERDA data was not permanently affected by the outage which can be seen as marker of the robustness of our general infrastructure. On the bad side we've received reports of some ERDA Seafile users getting one or more files rolled back to a previous version effectively overwriting any recent changes. We are of course sorry for any inconvenience this has caused and we have done our best to help trace down the underlying problem.  We would also like to emphasize that Seafile is a third party service we only host on ERDA due to popular demand. Thus, it follows the same backup policies, meaning that you as a user are responsible for explicitly making backups. You may use e.g. our Archive feature which copies data to off-site tape for strong protection against any such data loss.", 
      "DK": "Vi oplevede et massivt systemudfald p.g.a. en diskfejl samtidig med at en CPU stod af. Resultatet var at store dele af vores systemer var offline det meste af dagen, indtil vi havde fået genetableret og migreret services til en anden maskine. Hvis man skal se noget positivt i det kan det noteres at al almindelig ERDA data overlevede, hvilket bekræfter os i robustheden af vores generelle infrastruktur og design. På den negative side må vi desværre sande at enkelte Seafile-brugere har oplevet at en eller flere af deres filer efter udfaldet automatisk er blevet rullet tilbage til en tidligere version og dermed har overskrevet senere ændringer. Vi er naturligvis meget kede af det gener det har medført, og vi har gjort vores bedste for at hjælpe med at finde frem til det bagvedliggende problem. Vi må understrege at Seafile er en tredjeparts-service, som vi kun tilbyder på ERDA p.g.a. særlig efterspørgsel. Derfor har vi ikke fuld kontrol eller kendskab til hvordan den fungerer internt. Den følger desuden samme backup-politik, d.v.s. du er som bruger selv ansvarlig for eksplicit at lave backup af kritiske data. Dertil kan du f.eks. benytte vores Archive funktion, som kopierer data til bånd på en fjernlokation med henblik på stærk sikring mod netop sådanne datatab."
    }, 
    "announce_end": "2017-11-02T23:59:59+01:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2017-09-21T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
      "ERDA"
    ], 
    "announce_start": "2017-09-21T00:00:00+02:00", 
    "title": {
      "EN": "High-performance SFTP Service in Beta", 
      "DK": "Optimeret SFTP i beta"
    }, 
    "services": [
      "SFTP"
    ], 
    "work_end": "2017-09-21T23:59:59+02:00", 
    "description": {
      "EN": "Our new high-performance SFTP service is now available on sftp.erda.dk with the same login procedure as the existing one on io.erda.dk. You can try it out as a drop-in replacement using the same procedure just replacing the address. We've measured speedups ranging from 10 to 32 times for transfers on a fast network link to ERDA. Even on slower networks you are likely to see improvements.", 
      "DK": "Vores nye optimerede SFTP service er sat i beta-test på sftp.erda.dk med samme login-fremgangsmåde som den hidtidige på io.erda.dk. D.v.s. man kan afprøve den på helt samme måde som beskrevet i brugervejledningen, blot med skift af io til sftp i adressen. I vores egne tests har vi observeret 10 til 32 gange bedre hastighed over hurtige netværksforbindelser til ERDA. Selv på langsommere forbindelser skulle man dog også gerne opleve tydelige forbedringer."
    }, 
    "announce_end": "2017-09-21T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2017-07-25T00:00:00+02:00", 
    "references": {
      "EN": [
        "http://www.erda.dk/index.html"
      ], 
      "DK": [
        "http://www.erda.dk/index.html"
      ]
    }, 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ], 
    "announce_start": "2017-07-25T00:00:00+02:00", 
    "title": {
      "EN": "OpenID Login for Users without a UCPH Account", 
      "DK": "Særskilt OpenID-login for brugere uden en KU konto"
    }, 
    "services": [
      "OpenID"
    ], 
    "work_end": "2017-07-25T23:59:59+02:00", 
    "description": {
      "EN": "We've added another access method to allow people without a general KU/UCPH account to use ERDA/IDMC/MiGrid with simple username and password login. This new service makes it a lot simpler for e.g. external collaboration partners to sign up and use. Please refer to our FAQ entry on the subject for the details.", 
      "DK": "Vi har tilføjet endnu en adgangsløsning for at kunne give folk uden en almindelig KU-konto tilsvarende login til ERDA/IDMC/MiGrid med brugernavn og kodeord. På den måde er det blevet markant nemmere at koble eksterne samarbejdspartnere på, sådan som det er beskrevet af det tilhørende punkt i vores FAQ på forsiden."
    }, 
    "announce_end": "2017-07-25T23:59:59+02:00"
  }, 
  {
    "status": "AUTO", 
    "work_start": "2017-04-21T00:00:00+02:00", 
    "references": {
      "EN": [], 
      "DK": []
    }, 
    "systems": [
        "ERDA", "IDMC", "MiGrid"
    ], 
    "announce_start": "2017-04-21T00:00:00+02:00", 
    "title": {
      "EN": "Write-restricted Workgroup Shared Folders", 
      "DK": "Skrive-beskyttede delte workgroup-mapper"
    }, 
    "services": [
      "ALL"
    ], 
    "work_end": "2017-04-21T23:59:59+02:00", 
    "description": {
      "EN": "The workgroup infrastructure was changed to allow the associated shared folders to be write-protected by owners. In effect this allows easy sharing of data in a read-only fashion inside workgroups. All workgroups will still have their shared folder in read/write mode by default but owners can switch all new workgroups to read-only from the workgroup administration page. It should be noted that all workgroups created before this date will need to be migrated first if they are to provide the same feature. Please contact support about such inquiries.", 
      "DK": "Infrastrukturen bag de delte workgroup-mapper er ændret så den tillader ejere at skrive-beskytte data. I praksis er det dermed muligt at dele data kun med læse-adgang i en workgroup. Som standard får alle workgroups stadig delte mapper med både læse- og skrive-adgang, men ejere kan slå skrive-adgang fra på administrationssiden for en workgroup. Bemærk at alle workgroups oprettet inden denne dato først skal migreres til den nye struktur for at få samme funktionalitet. Kontakt venligst support omkring sådanne forespørgsler."
    }, 
    "announce_end": "2017-04-21T23:59:59+02:00"
  }
]
